[
  {
    "session_code": "PLA1224B",
    "title": "10GB to Workload Pricing: Our Journey in Getting Splunk Buy-In at Scale",
    "abstract": "My journey to the cloud started with a 10GB flux capacitor at a company whose roots date back to 1889, where there was no concept of what a cloud was. Before we started our cloud journey, it was time to hit pause. Our tech stack—like Doc’s DeLorean’s—was thrown together and had issues with takeoff when it came time to SOAR. When I reflect, a few things come to mind. First, I had loftier goals than my bosses. Second, I wanted to take it across the enterprise, not just my division. Third, I was going to need as much assistance as possible. Let’s not forget this is not a personal Splunk journey, it is the company’s journey, and buy-in from all levels is critical.",
    "first_speaker": "Robert McCoy",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "SEC1708A",
    "title": "AbnorML Detections - Using Math To Stop Bad Guys in ES",
    "abstract": "We've got mountains of data and need something like an electromagnet to find the needle in the haystack. Data Science for Adversarial Environments can be tough because of a lack of labeled data, class imbalance, and the difficulty of balancing false-positive/true-positive rates for alerts. In this session, learn about four distinct security detection methods using Enterprise Security (ES) that have proven successful at identifying malicious activities in the wild. Then, watch them stack together into an ensemble model (like VOLTRON) that puts a spotlight on your adversaries so you can spot security violations, fraud, and insider threats. Along the way, learn about some fundamentals of Data Science for Security that help make the job a lot easier.",
    "first_speaker": "Tyler Williams",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "ITO1425B",
    "title": "Accelerating Remediation @T-Mobile : Using ML-based Anomaly Detection for T-Mobile Messaging Services",
    "abstract": "How can you catch outages quickly despite a high volume and a high velocity of data? As part of an AIOps (Artificial Intelligence for IT Operations) journey, T-Mobile overcame the increasing complexity of Messaging infrastructure and reduced the number of large outages to a minimum. Leveraging Splunk MLTK (Machine Learning Toolkit), the team built dashboards for Messaging platforms, applied anomaly detection on multiple data sources and employed anomaly models to quickly isolate incidents. In this session, attendees will learn the journey, ML capabilities and techniques that transformed T-Mobile's operations and yielded significant improvements in customer experience & service availability.",
    "first_speaker": "Vijay Veggalam",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "SEC1249A",
    "title": "Accenture’s Journey to Risk Based Alerting with Splunk Enterprise Security and Beyond",
    "abstract": "After migrating from a legacy SIEM to Splunk, Accenture's SOC was challenged to find operational efficiencies as it expanded monitoring without increasing headcount, and Splunk's Risk Based Alerting (RBA) functionality enabled the efficiency realization. Customers are responsible for translating Splunk's RBA framework into a detailed playbook. Accenture designed and built the components to implement RBA, allowing it to realize tangible benefits, including improved SOC economics, increased enablement for multicloud monitoring, and continued use of Splunk SOAR tools to drive automation and reduce dwell times. Attendees will learn how Accenture built a large-scale, multicloud RBA implementation and see the measured effect of RBA on notable event fidelity.",
    "first_speaker": "Chip Stearns",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "ITO1576C",
    "title": "Adaptive Thresholding... Demystified!",
    "abstract": "Did you know that adaptive thresholding with Splunk ITSI brings AI and ML to your organization's IT and business operations? If you're not using it, you're missing out! Perhaps you're staring blankly at the thresholding configuration screen wondering what the heck to do next! In the words of Michael Jackson, You are not alone! And I am here for you!\n\nIn this session, we'll demystify those adaptive threshold algorithms! To start, we'll review the algorithms and implementation in detail. After that, we'll apply our learning through an interactive thresholding session of some real-world KPIs from a customer environment. You'll leave confidently understanding how to apply AT in your environment.\n",
    "first_speaker": "Jeff Wiedemann",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "SEC1466A",
    "title": "A Deep-Dive Into How Zoom Is Building a World-Class Detection Pipeline in Response to the Zoom-Boom!",
    "abstract": "Zoom has become a household name with the rise in the work from home and learning at home popularity. And with great popularity comes great responsibility! We at Zoom understand this and are on a mission to build a world-class detection pipeline. In this event, we’ll talk about how we are centralizing data collection into a data lake, integrating the data lake with Splunk, harnessing risk-based alerting, ML and AI to detect the anomalies and intruders.\n \nWe’ll also talk about how we are automating response orchestration and minimizing human intervention and response time to security alerts, and automating the entire pipeline to keep up with the increasing popularity of Zoom.\n",
    "first_speaker": "George Navarrete",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "TRU1112B",
    "title": "Administrators Anonymous: Splunk Best Practices and Useful Tricks I Learned the Hard Way",
    "abstract": "Throughout my journey as a Splunk admin, architect and instructor, I've experienced a few stumbling blocks along the way (okay, maybe more than just a few). Having seen others make some of these same mistakes, I want to show you how you can avoid them. In this session, you will learn how to detect some of the common pitfalls, leverage best practices and other useful insights. This session was one of the highest-rated sessions of .conf2019 and .conf2020 and has been updated to include even more information and best practices—especially around Splunk Cloud Platform—for keeping your Splunk environment running its best.",
    "first_speaker": "Tom Kopchak",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "PLA1327B",
    "title": "Advanced Scheduling with Splunk to Help Ensure Your Searches Run, Succeed and Cover All Data",
    "abstract": "With minimal up-front effort it is possible to guarantee that your alerts and other scheduled searches run, are always successful, and do not miss data. Common challenges are skipped searches, latent data, Splunk down time, failures, and dependencies on other searches. Approaches such as an expanded sliding window consume additional resources and will inevitably fail. We will demonstrate a Splunk macro that tracks search execution times in a KVstore and dynamically controls the search timeframe, thus decoupling it from execution time. This additionally provides a capability to quickly and easily re-run a search over any timeframe in a controllable manner. We will further demonstrate the use of Apache Airflow for more complex use cases.",
    "first_speaker": "Andrew Smith",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "ITO1779C",
    "title": "An Introduction And What’s New Over The Past Year",
    "abstract": "Have you heard the buzz? Splunk IT Service Intelligence (ITSI) just hit its latest release, and it’s jam-packed with new features you just can’t miss, including the latest in-service monitoring, event management and predictive analytics. Attendees at this session can sample it all, from just getting started to making the most of the latest and greatest.",
    "first_speaker": "Ian Torbett",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "PLA1553B",
    "title": "Anomaly Detection, Sealed with a KISS",
    "abstract": "The Splunk team at IG Group faced a common problem: supporting a web platform with the features and availability demanded by their users with an ever-growing number of apps and services. With so many applications, understanding deviation from their normal behaviors was critical to detecting issues quickly and preventing customers from turning elsewhere. In this session, we share how IG Group operationalized Anomaly Detection using the Splunk Platform and Machine Learning Toolkit (MLTK) to simplify both complex application architectures and Splunk ingestion pipelines.",
    "first_speaker": "Rupert Truman",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "SEC1395A",
    "title": "Anomaly Mining in Windows Event Logs",
    "abstract": "Most security practitioners are very familiar with the traditional rules-based part of a SIEM solution. Data science and data mining techniques take a ML based approach to understand the behavioral characteristics of the data. By analyzing the normal behavior or just by finding clusters of similar events that involve users, devices or even event codes, we can enhance the detection capabilities of any SOC.\nIn this session, we will introduce a ML pipeline, freely available to any Splunk user with the Smart Windows Security Insights App for Splunk, using algorithms that are part of the MLTK app. Attendees are introduced to the core and practical aspects of these algorithms, which will allow them to adapt this proposal to their own use cases.\n",
    "first_speaker": "Greg Ainslie-Malik",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "ITO1256B",
    "title": "Application Integration Monitoring Using Splunk ITSI",
    "abstract": "Lenovo IT has been working on their AIOps transformation for over two 2 years. As some of you may have experienced, with the development of an AIOps program comes the increasing complexity of application system architecture. At Lenovo, one of the key pain points of both IT Operations and the business overall was application integration monitoring. Poor or failed performance application integration always caused business impact, which impacted customers, as well as a lot of additional IT effort. Join to hear how Lenovo completed the implementation of a large number of application integration monitoring in a short period by using Splunk ITSI and close with best practices to help you in your AIOps journey.",
    "first_speaker": "Jin Chen",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "PLA1581A",
    "title": "A Realist’s Guide to a Successful Splunk Cloud Platform Migration",
    "abstract": "And you thought migrations were hard… well, they are. The good news is that with careful planning and just the right amount of teamwork, it is possible to migrate multiple Splunk Enterprise environments to Splunk Cloud Platform expeditiously and effectively. This project was incredibly important for the GE Digital Telemetry team in order to shift their focus from managing Splunk Enterprise and its underlying architecture to creating valuable content. This has echoed its way back to the business, fueling the speed of innovation for their users. When it was all said and done, the careful planning paid off with dividends yielding not only time and money back to the team but a renewed focus on analysis on Security, IT Operations, and DevOps. Come join us as we lay out our journey to the cloud, all the careful considerations put into planning, and lessons learned along the way.\n",
    "first_speaker": "David Rutstein",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "PLA1267C",
    "title": "Attention Splunk Admins! Simplify Search Management at Scale",
    "abstract": "Role quotas, user quotas, system quotas, admission rules, concurrency limits, scheduler limits, workload management - how do I make sense of all these features and more importantly, how do I use them to manage search workload at scale? When I first joined as a product manager at Splunk, it baffled me for a while before I understood how these settings work in sync. In this presentation, we will demystify the search management tools available for you. We will also reveal newly developed search controls and enhancements that simplify your task as a Splunk administrator. Finally, we will have a demonstration of some of these capabilities to solve specific use cases.",
    "first_speaker": "Manu Jose",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "SEC1590C",
    "title": "Augmented Case Management With Risk Based Analytics and Splunk SOAR",
    "abstract": "Automate those tedious case management tasks throughout the Incident Response lifecycle using Splunk SOAR. In this session, you'll learn how to build a world-class response program leveraging Splunk Risk Based Alerts, micro-playbooks and modular workbooks to accelerate your Time to Resolution in an Incident. Utilize new Splunk out-of-the-box playbooks to accelerate your Incident Response program.",
    "first_speaker": "Philip Royer",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "SEC1209A",
    "title": "Automated Vulnerability Detection and Verification with Ernst and Young & Splunk",
    "abstract": "The entire vulnerability management cycle can be tedious, and security teams are expected to effectively communicate to prevent any malicious actors from exploiting known vulnerabilities. From identifying assets that have vulnerabilities to remediation and validation, every part of the vulnerability management cycle can be automated to help security teams feel less overwhelmed and more in control. Dominic Salas from Splunk's Global Security Team and Rob Mayeski from Ernst and Young will demonstrate how they use Splunk SOAR to assess vulnerabilities and validate if those vulnerabilities are indeed patched, so the known vulnerability no longer presents a threat.",
    "first_speaker": "Robb Mayeski",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "SEC1426B",
    "title": "Automating Subjectivity Out of Inspections and Improving Cyber Hygiene",
    "abstract": "Join us to learn about how an IT Specialist with the Department of the Navy is solving enormous compliance visibility and assessment challenges through data collection, reporting and visualization at an enterprise scale. Naval Sea Systems Command has limited staff and budget resources to meet legal and regulatory standards that are now being solved by leveraging Splunk to help automate the reporting of cybersecurity posture information. This session will help information system engineers, security managers and Risk Management Framework (RMF) experts understand how to quickly identify and remediate compliance issues without time-consuming subjective manual inspections that ultimately result in outdated scorecards and overdue findings.",
    "first_speaker": "Drew Church",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "PLA1135C",
    "title": "Avoid Data Loss While Forwarding Into Splunk With Low-Cost Advanced Redundancy Architecture",
    "abstract": "For forwarding/streaming of critical data, the environment should be resilient enough to ensure continuous availability and even handle hardware failures. While Splunk's native clustering provides data storage redundancy, what about the data that has not yet arrived to peer nodes? How much downtime can your forwarders survive before losing data? Is there a way to use more than one Master Node? This session will demonstrate various methods of clustering and cloning Splunk servers to improve data reliability without wasting licensing bandwidth. Discover the subtle but crucial architectural differences used to create an advanced forwarding environment of your dreams.",
    "first_speaker": "Nikolas Macroglou",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "SEC1382B",
    "title": "Before You Leave The Nest — Preparing to SOAR",
    "abstract": "To make Splunk SOAR a success in any organization, there are important steps to undertake before implementing any solution. We will discuss how our team prepared and successfully implemented Splunk SOAR (Phantom) and achieved demonstrable ROI within the first six months of operation. This talk will detail the steps anyone embarking on a Splunk SOAR journey can take to get value out of investment in any platform, as well as some of the lessons we learned along the way. We will also cover the processes teams can build around Splunk SOAR (Phantom), how they integrate into day-to-day SOC operations, and how these will drive even more value in the future.",
    "first_speaker": "JP Haywood",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "PLA1264B",
    "title": "Best Practices and Better Practices for Admins",
    "abstract": "Make your Splunk platform a palace with these best practices! This is an updated version of the highly rated sessions from .conf19 - .conf20. In this session, we will review platform tips & tricks you've regretted not knowing. Attendees are encouraged to support each other by sharing their own best practices, tips & tricks, and love for all things Splunk! We'll explore topics relevant for platform admins, such as effective Splunk resourcing, common pitfalls and monitoring console - all with a fun and interactive session!",
    "first_speaker": "Burch >",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "ITO1694C",
    "title": "Better Together Like Chocolate and Peanut Butter:  Splunk Observability +  ITSI",
    "abstract": "With Splunk Infrastructure Monitoring we get real time metrics delivered at high resolution and with Splunk IT Service Intelligence we capture full stack visibility from the infrastructure all the way to where it matters... the business impact. What if we were able to use both products together to achieve real time and high fidetility metrics while providing key business insight, intelligent event grouping, and predictive capabilities? In this session we will cover how to bring the value of both products together by using the Splunk Add-on for IM, and show how you can seamlessly integrate with the new Entity Types, Vital Metrics, and Content Library to get quick success from both products.",
    "first_speaker": "Jonathan Fair",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "PLA1484B",
    "title": "Big Data Platform (BDP) Replacement Through Splunk",
    "abstract": "Learn about the 'how' and 'wow' of replacing a large federal agency Big Data Platform (BDP) at \"Dependable Paper Shredding Co\" (DPS) with Splunk. Accenture Federal Services (AFS) and Splunk worked with DPS to replace their open-source system and build the functionality in Splunk. Cost savings were estimated at nearly $50M for the new system. Accenture's own methodology for NextGen SOC, which is also realized in AFS Managed XDR for government, is baked into client replacement of BDP. Accenture leverages its strong #1 Global Partnership with Splunk, particularly with regards to over 500+ engagements, 5,000+ training professionals, and numerous trusted advisors with industry knowledge and analytics experience across commercial and federal.",
    "first_speaker": "Gared Seats",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "ITO1185B",
    "title": "Botify Splunk To Improve Collaboration, Cost and MTTR",
    "abstract": "Do you have business users who don't know SPL but want to access data in Splunk? Want to give them the ability to ask questions in their natural language?\n \nJoin this session to learn how to start leveraging Chatbots with Splunk to accelerate investigation, improve cost savings by eliminating human errors, and take Mean Time to Resolve (MTTR) from hours to minutes. \n \n See how Dell's Site Reliability Engineering team uses Splunk and the Microsoft Bot framework to bring Splunk data in real time, in a personalized format to their business users, executives and engineers. They will also showcase a demo of how their team is breaking down silos and democratizing Splunk data to improve team collaboration, tools integration and derive insights that help them make informed decisions on the fly.\n",
    "first_speaker": "Tanuj Arcot",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "S4U1414A",
    "title": "Bridging the Data Divide To Solve Social and Environmental Challenges",
    "abstract": "As the Data-to-Everything platform, Splunk’s Global Impact mission is to Bridge the Data Divide to find actionable solutions for a more just, sustainable and healthy world. Join this session to learn what leaders in the field are doing to bridge the Data Divide and ensure data is used to find solutions for issues such as equitable health care, urban planning, environmental sustainability, just education and economic opportunity for all—and the list goes on. Become a Data Divide champion to empower problem solvers from all sectors to harness the power of data for positive social and environmental impact.",
    "first_speaker": "Kriss  Deiglmeier",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "DEV1801B",
    "title": "Build a Self Service UI To Automate Splunk Provisioning Utilizing the SDK and REST API",
    "abstract": "Are your app teams growing faster than what your Splunk admins can manage? We'll dive into an overview of how Ford's Monitoring Team empowers its application teams by providing a self-service user interface to onboard their data into Splunk. This pipeline utilizes the Splunk SDK and REST APIs to allow integrations into your application portfolio and build Splunk directly into an application's development lifecycle. We'll elaborate on automating data ingestion and user integration. Learn how Ford's compartmentalized approach automates Splunk to drive growth and generate better user experiences.",
    "first_speaker": "Ben Sanchez",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "DEV1244C",
    "title": "Build Ready-to-Install Apps for Splunk Cloud Platform",
    "abstract": "Do you ever wonder what is the fastest way to get your app installed and configured in Splunk Cloud Platform? Learn how to develop Splunk Cloud Platform apps that you can deploy for your customers to use right away, from initial release to ongoing updates. We'll walk through how you can create streamlined and intuitive configuration and upgrade flows that help your customers get started with your apps. You'll learn what \"self-service app install\" means and how to create configuration experiences using setup pages. We'll also dive into how you can use Splunk AppInspect to understand our Cloud-vetting process and how to release apps on Splunkbase. This breakout session is packed with information for app developers and will also include a live coding demo.",
    "first_speaker": "Timothy Pavlik",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "PLA1265C",
    "title": "Busting the Curve: Specific Techniques to Decouple Splunk Cost From Your Exploding Machine Data Volumes",
    "abstract": "To do things right, you must do more things right. The promise of Workload Pricing is to fundamentally alter the cost curve related to Splunk so that you can carry one of your favorite platforms to an increasing number of use cases. To achieve this goal, Splunk users need to create an environment that incentivizes the right best practices. Attend this session to learn some key techniques to apply to lower cost per gig and improve efficiency. This session will start with a broad view of the machine data ecosystem and traverse down to low level inner workings of Splunk to share specific ways that you can improve your practices to bust the curve.",
    "first_speaker": "Jeff Meyers",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "SEC1508A",
    "title": "Calling Security Mavericks: Fulfill Your SOC Need For Speed With Google Cloud & Splunk",
    "abstract": "It’s more critical than ever to secure your company data and protect your workloads. In this session, we’ll show you how to use high fidelity Google Cloud logs and automated security findings from Google Cloud Security Command Center (SCC), cloud-tailored detections from Splunk Enterprise Security (ES), and automated response from Splunk SOAR to enhance your threat prevention, detection and speed up your response techniques. We’ll also dive into how GCP security data map into existing Common Information Model (CIM) models to leverage out-of-the-box content available in ES, ES Content Update and Splunk Security Essentials App. Finally, we’ll show how you can map out this threat content while following the open MITRE ATT&CK framework.",
    "first_speaker": "Wissam Ali-Ahmad",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "PLA1364C",
    "title": "Capital Markets Industry - Intelligent Trade Lifecycle with Splunk",
    "abstract": "Increase transparency and insights into the intelligent trade lifecycle with Splunk. The Capital Markets industry is emerging from years of legacy system and process customizations that have consistently increased the cost per trade. Come learn how Accenture uses Splunk to help firms harness the power of big data to increase efficiency and focus on profitability.",
    "first_speaker": "David Treat",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "TRU1124B",
    "title": "Care and Feeding Of the Splunk Cloud Platform for Admins and Developers",
    "abstract": "Knowledge object and configuration management on the Splunk Cloud Platform is unlike anything you are used to in Splunk Enterprise. Join us in learning about all the differences, big and small, including every weird nuance. Come explore the bleeding edge of CI/CD and deployment automation in the Cloud and walk away with a reliable set of best practices you can use to keep things up to date!",
    "first_speaker": "Atef KOUKI",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "DEV1635C",
    "title": "Case Study On Building a Splunk Integration Using a Webhook API and Serverless Functions",
    "abstract": "On the Splunk for Good team, the digital age has been an opportunity to integrate Splunk with new technologies that enable our nonprofit partners to utilize data to fulfill their missions. In building these integrations, we’ve realized organizations don’t want to manage infrastructure if they don’t have to. Traditional APIs often meant organizations needed to have code running on costly servers to gather data, correlate data and gain value out of data. We are excited to talk about how we built several Splunk integrations with various Webhooks APIs using an entirely serverless architecture, why this is so important for your organization as you journey to the cloud and show you how you can do the same thing.",
    "first_speaker": "Ryan O'Connor",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "DVO1137A",
    "title": "Channel Your Network Observability Superpowers With eBPF Technology",
    "abstract": "In this session, we will look beyond on-premise NPM technologies like SNMP to an approach for service-aware, host-based cloud network monitoring for hybrid and multi-cloud environments. We will deconstruct what is required to process network telemetry with high-throughput and low latency while enriching it with actionable application metadata. For this tech spotlight, we will do a deep dive into eBPF technology as the means of observing network behavior from the operating system, using open source instrumentation to collect network telemetry data from every socket without ever changing your application code and containers. Join us as we show how these technologies can be applied to improve observability in your cloud-native environment.",
    "first_speaker": "Jonathan Perry",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "TRU1133B",
    "title": "Clara-Fication: More Tstats for Your Buckets",
    "abstract": "Searches slower than a drifting continent? Time to \"accelerate\" them! In this talk, we'll explore the nitty-gritty of how the tstats command works and how to get the most out of it. You'll leave knowing not just how to optimize old searches but also how to write the new ones more efficiently. Let us PREFIX the session by saying that you don't want to miss this!",
    "first_speaker": "Martin Müller",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "KEY1832",
    "title": "Closing Keynote (AMER)",
    "abstract": "Celebrated actor of the stage, screens of all sizes, and new media, Mark Hamill will speak with Splunk Engineering V.P, Kate Matsudaira, about his career and his legendary turn as Luke Skywalker.",
    "first_speaker": "Mark Hamill",
    "start_time_utc": "2021/10/20 22:30:00",
    "end_time_utc": "2021/10/21 00:00:00"
  },
  {
    "session_code": "PLA1102B",
    "title": "Cloud Migrations Without the Migraine",
    "abstract": "Are you an existing Splunk on-prem customer, but curious about Splunk Cloud Platform? We saw a massive influx of customers migrating to Splunk Cloud Platform last year, and in this talk we will share the details of their journey. You will learn about the types of migrations we see, how to best plan for your migration, which tools will simplify your migration, how to avoid common pitfalls and what to expect once you're in Splunk Cloud Platform.",
    "first_speaker": "Kyle Champlin",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "SEC1380C",
    "title": "Come Together, Right Now: Bolster Team Effectiveness with Splunk Mission Control",
    "abstract": "Inefficiencies in your security operations can be costly. Security teams need their tools to work for them—not against them—especially in urgent times when it's all-hands-on-deck. Splunk Mission Control can help bolster your team’s effectiveness by utilizing a cloud-based platform that provides a common work surface for security teams. In this session, we’ll cover new capabilities within Mission Control that can help you effectively train your analysts, collaborate with one another and streamline case management. We’ll also feature use cases that you can incorporate by leveraging our open Plugin Framework to further optimize your team’s security operations.",
    "first_speaker": "Wissam Ali-Ahmad",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "TRU1053B",
    "title": "Dashboarding Wowzas! Top Tips for Making Your Dashboards Awesome",
    "abstract": "Whether it's a dashboard for a CEO or for a team of developers. Using a dashboard to maximize the value of your data can sometimes be tricky. In this session, I'll share some favorite dashboarding tips and tricks to show you how to easily put together a dashboard that is both awesome and super easy to manage!",
    "first_speaker": "Thomas West",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "S4U1796C",
    "title": "Data-Driven Enhancements: How Splunk Ideas Leverages the Power of the Splunk Platform To Connect Product Managers With Customers and Context",
    "abstract": "By focusing on transparency and responsiveness between our customers and product managers, Splunk Ideas transformed a customer-feedback black hole into a keystone for Products' Voice of the Customer program. Splunk Ideas leverages the power of the Splunk Platform to deliver a data-driven approach to product prioritization and strategy. Since launching in 2020, we've collected 4000+ ideas and 80,000+ vote submissions and engaged the community with nearly 3000 comments. Come learn about how our Splunk App for Ideas pairs SPL and dashboard wizardry to deliver a personalized, automated solution that provides product managers with valuable context and workflows to drive their prioritization decisions and understand and track their tasks in one place.",
    "first_speaker": "Jesse Miller",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "PLA1573C",
    "title": "Data Driven Splunk Analytics, Chargeback and Administration at Scale",
    "abstract": "Are you struggling with tracking Splunk usage, the value it brings to your organization and effectively scaling your Splunk Cloud?\n\nIf you are a Splunk Admin or Manager of a Splunk Platform team, come learn how Liberty Mutual is centralizing, standardizing and improving its platform metrics in a large scale, high adoption environment. Liberty Mutual’s monitoring approach enables you to perform efficient platform wide investigations against many metrics in a single console. Areas of insight include: Chargeback, Understanding how and where your Splunk investment is being used, getting your user HR data into Splunk for correlation, automating cleanup and maintenance efforts (knowledge objects cleanup, configuration management), maximizing search efficiency, stack health, change management tracking, and user, job and dashboard usage activities over time.\n",
    "first_speaker": "Amir Khamis",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "ITO1117C",
    "title": "Data Drivers: Racing to Observability in IT",
    "abstract": "IT Modernization is a journey; why not use a McLaren to get there? \n \n Data Drivers is a series of iRacing.com sim-races and live-streamed hackathons leading participants through a hands-on learning experience with Splunk Observability Cloud and IT Service Intelligence. We partnered with McLaren’s Shadow Esports team and their manager, Tobin Leigh, to build powerful insights by turning more than 300 metrics into actionable intelligence for the racers and the management team. Join this session to see how Splunk Observability Cloud and IT Service Intelligence powered this fun and engaging series and learn how you can get your hands on the wheel and the data with us in the future.\n \n Whatever you’re into, be data driven. Join Data Drivers.\n",
    "first_speaker": "Cory Minton",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "DVO1766C",
    "title": "Data Science for Observability",
    "abstract": "To be honest, this talk will be about average. Against all odds, we will aim to show that the mean and standard deviation are more interesting and powerful than they appear. After some review, we will discuss properties and characterizations of these apparently innocuous statistics with an eye toward analytics problems arising in observability. This will prepare us to explore datasets on which these statistics may be misleading and hence produce inaccurate alerts (and correctives for such), the problem of selecting and tuning statistical thresholds for alerts, and some perhaps surprising applications. As a consequence, we produce dynamic and high-quality alerting strategies incorporating real-world experience. No statistical background is assumed; some interest in statistics may be gained.",
    "first_speaker": "Joe Ross",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "PLA1277B",
    "title": "Data to Everything: Get Started With Splunk Mobile, TV, AR, VR",
    "abstract": "Join us for a jam-packed session where you’ll learn all about the security and flexibility of Splunk Connected Experiences (including Splunk Mobile, TV, AR and VR). We’ll focus on the backend products, Spacebridge and Splunk Secure Gateway that make it all possible and bring you up to speed on the new features built to empower YOU. You’ll walk away with clear knowledge on how the data flow works and how you can bring it to your organization. SAML, SOC-2, Splunk Dashboard Studio — we got it all, and now we want to share it with you!",
    "first_speaker": "Michael Emery",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "S4U1536B",
    "title": "Data to Impact: Using Splunk to Protect Children and Alleviate Poverty",
    "abstract": "At Compassion International, our mission is to alleviate the number of children who live in poverty. Over the past two years, we created an application on Splunk called PATCh that took our sponsor and volunteer screening process from 7-30 days to just minutes keeping bad actors away from our children and shortening the time to greenlight genuine sponsors. Every day we get to work with and support amazing children worldwide and every day we use Splunk to protect these very same children from predators and other bad actors. In this session, we’ll cover how we created PATCh, leveraging Splunk dashboards to communicate impact to our entire organization, and how we plan to use the machine learning toolkit.",
    "first_speaker": "Brian Cusick",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "DVO1312B",
    "title": "Debating Logs vs. Traces: Lessons Learned Adopting Distributed Tracing At Shopify",
    "abstract": "In the five years since Shopify began rolling out distributed tracing to production environments, they’ve encountered many misunderstandings about its value, how it works and when to use it. Software engineers are comfortable with metrics and traditional APM suites yet often rely on logs as the source of truth and default signal for debugging applications. Shopify engineering is known for shipping new features at extreme scale, and that has left little time for developers to explore new tools that may help them answer questions and resolve problems faster as Shopify’s architecture evolves from a monolith to an increasingly large constellation of services. Join Shopify’s Francis Bogsanyi, production engineering lead and Splunk’s Joshua Grose, senior product manager, as they debate logging vs. tracing and dive into common misconceptions, past mistakes, and how Shopify is working on teaching developers when and how to use tracing, and why.",
    "first_speaker": "Joshua Grose",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "DVO1778C",
    "title": "Deep Dive Into How Splunk Observability Can Help You Reduce Infrastructure Downtime",
    "abstract": "Now more than ever, the time — in seconds — something is down directly correlates to revenue lost. Learn how Splunk Observability can help reduce downtime with reduced mean time to clue (what is the root cause of the outage) and MTTR (mean time to resolution). Help your DevOps teams spend less time responding to alerts and being part of incident response teams working to resolve outages. With less time spent on incidents, DevOps can further reduce the number and duration of outages by adding auto-remediation and other enhancements or working on new projects. ",
    "first_speaker": "Melody Hazi",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "DEV1387B",
    "title": "Deep-Dive Into the Custom Search Protocol v2: How To Implement a Custom Search Command in Any Language",
    "abstract": "If you have ever wanted to create a Custom Search Command using a language other than Python, then this is the presentation for you. To implement a command in a different language such as JavaScript, you will need to implement the Custom Search Protocol (version 2) to pass correctly formatted messages correctly between your program and Splunk. Learn how Splunk identifies and communicates with your custom search command, the specific formatting of the messages passed between Splunk and your command, how to parse the parameters passed from Splunk and how to pass configuration options back to Splunk. We will look at how a custom Search command was written in JavaScript for the CyberChef for Splunk App.",
    "first_speaker": "Noah Dietrich",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "S4U1372B",
    "title": "Design Your Career & Life: Experience and Advice From 3 Women Mavericks Who Have Done It",
    "abstract": "If you've ever felt boxed in by your job, your career path, your life or all of the above... you're not alone! No matter how you choose to measure success, sometimes the best of it comes by bucking against what boxes you in and blazing yourself a bold new trail! In this panel, three women mavericks will share their unique perspectives pursuing and balancing personal career goals and life aspirations. These stories, rich with moments of negotiation, moments of concession and moments of creativity, will inspire and excite you to apply their tips and tactics to design the career and life of YOUR dreams.",
    "first_speaker": "Melissa Andrews",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "SEC1495C",
    "title": "DoH or DoH Not, There Is No Try. Is Machine Learning the Force You Need To Save Your Detections From the Encryption Empire?",
    "abstract": "DNS over HTTPS (DoH) is an enhancement to the DNS protocol. Encrypting these vital communications poses a clear benefit but also a cost. How can security teams who rely on DNS visibility to identify malicious activity continue to do so? Is the rug pulled from beneath them completely? What information remains? Is it possible to locate DNS traffic within a plethora of encrypted communications? We'll answer these questions by introducing methodologies for exploratory data analysis and machine learning to classify encrypted traffic within Splunk. Attendees will come away with a better understanding of DoH and a range of new techniques and technologies that could apply to their organization's environment to address these new challenges.",
    "first_speaker": "Joshua Cowling",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "ITO1457B",
    "title": "Driving Business Insights at Agero...It's No Accident",
    "abstract": "As the leading B2B technology provider of roadside assistance, consumer affairs, connected vehicle and accident scene management in the U.S., Agero recognizes the importance of 24/7 real-time monitoring and response. Providing business and operational insights into our platform's performance in leveraging fully automated service delivery through digital channels is mission-critical and the key to our success. Join us in this session as we discuss how we are achieving this – and more – on our cloud journey using Splunk Cloud Platform and ITSI to evolve from reactive to proactive response and our future of predictive analytics.",
    "first_speaker": "William Macdonald",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "ITO1399B",
    "title": "Driving Campus Sustainability With Your Wireless Data",
    "abstract": "NYU is committed to driving Sustainability across their campuses to reduce their current carbon footprint. Reducing resource utilization based on class schedules alone does not yield the types of opportunities that drive the results needed for their goals. We’ll discuss how NYU found a great way to get better visibility to actual occupation levels and trends through their wireless data captured on devices while on campus. Learn how Splunk (and NuHarbor) worked closely with NYU to develop quantifiable dashboards, which provide the NYU sustainability team with near real-time visibility into occupancy levels. Dashboards which help the team justify suggested changes to building schedules to support NYUs sustainability efforts.",
    "first_speaker": "Kevin Morris",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "SEC1745C",
    "title": "Hunting the Known Unknown: Supply Chain Attacks",
    "abstract": "This year's \"hunting\" session will describe how to deal with supply chain attacks that seem to be plaguing the world. This talk will help you understand the threats to your network (what the heck are they), identify your supply chains, and use Splunk to detect attacks on your network. Using case studies ripped from the headlines, our session will discuss which logs to collect and detection methods. Finally, we will release our tools and hunting techniques for attendees to take home, so they can start implementing these methods on their network immediately!",
    "first_speaker": "Ryan Kovar",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "DVO1822C",
    "title": "I Have Splunk Cloud Platform. What Can I Do to Add Observability?",
    "abstract": "As a Splunk Cloud Platform user or admin, you're using Splunk to monitor aspects of your infrastructure and custom applications, and perform investigations when things don't quite work. But the more cloud-native infrastructure and applications you're using, the more complex collecting, indexing and analyzing that data has become. In this fast-paced session, we'll outline three key ways to augment how you're using Splunk Cloud Platform to collect cloud-native data more easily, accelerate and simplify alerting, and add context to data so triage and troubleshooting are easier and faster. We'll focus on ways to augment infrastructure monitoring, use synthetic monitoring to gain better top-level monitoring data that reflects user experience, and look to observability principles to take a service-oriented view into your systems while instrumenting applications to supply insight into their availability, usage and performance. ",
    "first_speaker": "Brandon Currie",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "SEC1800A",
    "title": "Implementing Zero Trust: From Hype to Reality",
    "abstract": "Zero trust is a framework to defend against sophisticated attacks that target a growing population of distributed users, applications and data. To deploy zero trust effectively, three critical capabilities are needed. First, a robust data platform that supports real-time analytics with dynamic risk-based alerting. Second, the ability to respond to alerts in real time with rapid, automated orchestration. Third, contextual awareness of users and devices and their behavior patterns.\n \nIn this session, join Splunk Principal Security Architect Macy Cronkrite, Zscaler CISO Deepen Desai, and Zscaler’s Scott Bullock, TME to learn:\n - the foundations of zero trust\n - how to implement a zero-trust architecture that actually works\n - how to create effective and streamlined security operations using telemetry, risk-based alerting, user behavioral analytics and orchestration\n",
    "first_speaker": "Mecealus Cronkrite",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "SEC1702C",
    "title": "Improve Intelligence Sharing Efficiency and Governance Using TruSTAR Enclaves",
    "abstract": "Imagine having the flexibility to quickly share and consume indicators and threat intelligence from your ISACs or trusted partners without having to comb through emails or write additional scripts to automate this sharing. Learn how TruSTAR Enclaves enable the easy sharing of threat intelligence data across teams, tools and sharing partners like ISACs, ISAOs and trusted groups. Intelligence can also be anonymized when sharing with third parties to meet data governance standards.",
    "first_speaker": "Tyler Bent",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "DEV1826",
    "title": "Innovate and Modernize Faster with Splunk’s Comprehensive Enterprise Observability Solution (AMER)",
    "abstract": "In today’s hybrid world, don't let unexpected performance and availability problems get between you and your users. You need  full-stack, analytics-powered and enterprise-grade observability across all your infrastructure, applications and services so you can seamlessly transform your business while delivering secure, reliable and high performance services and user experiences. Come hear from Splunk’s VP of Product Management of Observability, Patrick Lin and GVP of Global ITOps/DevOps, Mala Pillutla, about how Splunk Observability empowers teams to quickly find, fix, and prevent more issues to ensure the health, availability, and performance of complex digital services. ",
    "first_speaker": "Patrick Lin",
    "start_time_utc": "2021/10/20 16:00:00",
    "end_time_utc": "2021/10/20 17:00:00"
  },
  {
    "session_code": "ITO1469B",
    "title": "Intel IT's Search to Maximize Splunk Performance and Cost Savings in a Hybrid Cloud World",
    "abstract": "In today’s hybrid IT environments, understanding where to spend dollars for performance upgrades can be challenging. Are you considering a hybrid cloud and object storage? What if you could tune Splunk search to pinpoint specific areas to target with high performance, high endurance storage to maximize your investments? The good news is YOU CAN! Join this session to learn how the appropriate alignment of storage and compute infrastructure can improve Splunk search performance. Intel IT will share production testing of different storage solutions, and how containers can support more users and process data faster - driving the evolution of their next generation Cyber Intelligence Platform.",
    "first_speaker": "Victor  Colvard",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "DEV1134A",
    "title": "Introducing Splunk UI Framework: Build Splunk Apps with React",
    "abstract": "Whether you are a current or new Splunk App Developer, we have exciting news for you! We are launching the Splunk UI Framework - a set of state-of-the-art front-end application development tools and libraries based on React to help you build powerful and flexible apps for the future. Join this session to learn the details and where you can go for resources and help.",
    "first_speaker": "Cody Coats",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "DVO1585C",
    "title": "Introduction to Splunk Synthetic Monitoring for Availability, Functionality and Performance of Your Websites and APIs",
    "abstract": "Fast, available Sites have never been more important. For DevOps engineers, developers and web admins, the promise of synthetic monitoring is to proactively detect and resolve issues while delivering a great user experience. With Splunk's acquisition of Rigor, Splunk now has best in class synthetic monitoring for quick troubleshooting and deep web performance optimization to improve end-user experience. Join AK Khamis and Georgios Glymidakis, Splunk professional services architects, as they showcase easy ways to proactively monitor basic uptime, API performance and customer experience across full page loads and user journeys.",
    "first_speaker": "Amir Khamis",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "ITO1515C",
    "title": "IT Incident Post Mortem Done Right: Best Practices for Using ITSI and Splunk On-Call To Improve Your Incident Management Process",
    "abstract": "Your outage is over and everyone can breathe easy. That is until you need to do the event post-mortem and report to your management how you will address this next time. If you're using the combo of ITSI and Splunk On-Call, you have everything you need to not only create an effective post-mortem report but turn that report into improved MTTD and MMTR in the future. In this session, we will review the capabilities within ITSI and Splunk On-Call that provide these types of deep historical insights, ways to create thorough, repeatable and consistent post-mortem reports and how to ensure that the insights from this practice are applied to your alerting and notifications to improve your incident management. ",
    "first_speaker": "Christopher Crocco",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "DVO1726C",
    "title": "Kubernetes Observability for Beginners: How Splunk Helps You on Your Journey",
    "abstract": "Since our first virtual .conf, many organizations have accelerated their technology transitions that were already underway, including the journey to the cloud, containers and microservices. Kubernetes is an important part of that journey, and it’s still a big lift. In this session, we’ll talk about how to observe your Kubernetes infrastructure, how to overcome some of the key challenges of monitoring a rapidly changing environment, and how Splunk Observability Cloud will get you there.",
    "first_speaker": "Rebecca Tortell",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "SEC1361B",
    "title": "Learn by Doing: California Polytechnic State University Students Enable Security Operations Center",
    "abstract": "California Polytechnic State University uses Splunk Enterprise Security. We employ the Cal Poly \"Learn by Doing\" learning philosophy, empowering our student employees to build our SIEM and SOAR toolsets. The student's work improves the security posture of our campus and its 24K users. We've developed a training program combining Splunk resources, internally developed materials, and on-the-job training and mentorship. In addition to handling daily alerts, we put the students to work creating SOC dashboards, queries, alerts and reports. The team of students is working on correlating data across various data sources to improve detection capabilities. Finally, we've created a \"badging\" program to document the skills students acquire.",
    "first_speaker": "Jon Vazquez",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "TRU1079B",
    "title": "Lesser Known Search Commands",
    "abstract": "Following up on previous years, this is a highly attended and well-received talk on lesser-known search commands in Splunk. Geared towards the beginner and intermediate, we will review search commands and other tricks that can be done with SPL that most folks are not commonly using. There will also be a brief slide on SPL2 and enhancements to the SPL language.",
    "first_speaker": "Kyle Smith",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "SEC1396C",
    "title": "Level Up! How To Go From a Beginner to a Champion in Splunk Security",
    "abstract": "Ever feel like you are a Level 1 character starting your security journey with Splunk? You want to figure out how to defeat a dragon… err adversary... but don't know where to start? Join us to hear how you can go from a Splunk beginner to a mighty threat hunter (or at least a mid-level rogue). We will guide you through the cheat codes of core Splunk and Enterprise Security using a prescriptive training roadmap showing how to gain XP as you go until eventually, you can be a Security hero with the skills and armor to match. This talk is for folks new to the Splunk adventure or even senior analysts/SOC managers looking for ways to level up their team!",
    "first_speaker": "Kathleen Brown",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "PLA1700B",
    "title": "Leveraging Observability in an Open Hybrid Cloud Environment",
    "abstract": "Observability on-premise is one thing. Gathering metrics, logs and alerts across different cloud providers and on-premise can be difficult to manage and even harder to act on. Learn how to use Red Hat Ansible Automation Platform to act on the data that observability provides to make your open hybrid cloud more robust and more secure.",
    "first_speaker": "George James",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "PLA1680A",
    "title": "Little Pain, Much Gain: Splunk at Intel Engineering",
    "abstract": "You can scale up Splunk to meet the demands with a very small team — you don't need an army within a large company. Intel is leveraging Splunk for much more than just IT and SIEM: With a small team, the flexibility of Splunk Enterprise has allowed us to establish an ecosystem for efficiently gathering and analyzing data in new and novel ways in large-scale integrated circuit chip design and manufacturing. We will explore the methods of standardization, made possible by Splunk's flexibility, that is facilitating data-driven decision making across Intel.",
    "first_speaker": "Yaron Kretchmer",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "S4U1298C",
    "title": "Make It So! Unified, Simple Splunk Cloud Platform Administration Using Terraform",
    "abstract": "If you’ve struggled to automate configuration of your Splunk Cloud Platform environment, you aren’t alone. Terraform makes it easy to manage some aspects of Splunk, such as roles and users, but it has some limitations. For example, lookup content can’t be managed via the REST API, and therefore Terraform. So how do you move past those limitations without supporting two or more separately managed automation solutions? We’ll show you how a common configuration can be used to get the most out of Terraform, enabling it to directly configure Splunk where possible and to create packaged apps for Splunk where not. As a bonus, we’ll show you how having a common configuration can simplify the population of lookups with properties of your index, role, etc. configurations.\n",
    "first_speaker": "Micah Kemp",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "PLA1450B",
    "title": "McLaren: Driven by Data",
    "abstract": "Over 40 years ago, McLaren ventured into data analytics by placing 24 sensors on a race car. One year ago, Splunk teamed up with McLaren to make the best use of that data and as of today, each car runs with more than 300 sensors, relaying the data between the track and mission control back in the UK in near real-time. This session will dive into McLaren Racing's cutting-edge use cases and explores how the esports phenomenon uses Splunk data analysis and live dashboards for the McLaren Shadow esports team. You'll gain an understanding of the power of Splunk data in increasing the esports team's competitiveness.\n",
    "first_speaker": "Edward Green",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "DVO1723C",
    "title": "Measure, Monitor and Optimize Front End Performance With Splunk Observability",
    "abstract": "As the global pandemic forced the world online and fueled digital accelerations, customer experience is more important than ever. The challenge: how to measure, prioritize and improve customer experience as you continuously build, deploy and introduce change to your systems and services. So how can SREs and developers balance web performance as they continue to build, debug and troubleshoot? Join this session to understand how you can leverage Splunk Synthetic Monitoring, Splunk Real User Monitoring and our intelligent optimization engine to easily prioritize, communicate and resolve performance issues as you build and deploy faster.",
    "first_speaker": "Deepti Bhutani",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "ITO1418C",
    "title": "Microsoft 365: Flying In the Dark at What Costs",
    "abstract": "Today, many organizations are migrating from on-prem (Microsoft Exchange) solutions for email/calendar/communications to Microsoft 365. These are critical processes, workflows and activities, which Microsoft 365 provides you with limited visibility. \n \nSplunk brings you the ITSI Content Pack Microsoft Exchange and another for Microsoft 365, providing full visibility into the: performance, availability, security, incidents and messages.\n \nBest manage your operations and deliver the highest service levels to your customers with visibility across your on-prem and cloud services as you migrate and reallocate resources to maximize value. Get instant insights from an: executive, business leader, security, DevOps and IT operations perspective.\n",
    "first_speaker": "Courtney Wright",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "ITO1743B",
    "title": "Microsoft Add-Ons: Ingestion and Parsing That Would Make Bill Gates Proud!",
    "abstract": "Let’s face it, we live in a Windows World with stacks upon stacks of Windows-centric machine data. Ingesting and parsing all that data can be a little scary if you’re doing it on your own (trust me, I’ve gone down that road). Splunk to the rescue! Using powerful and diverse Add-On’s for Microsoft Windows, IIS, etc., you can easily ingest and monitor those old Windows-based Logs in no time. We’ll look at inputs associated with these Add-Ons, including simple SPL searches to give you valuable insight into your Windows data. 0-60 data visibility with just a few Add-Ons? Sounds almost too easy, but it is!",
    "first_speaker": "Robert Riegert",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "DVO1164A",
    "title": "Mobile App Observability For iOS and Android",
    "abstract": "2020 was a year of 20% growth for the mobile app economy - for both daily hours spent per user (4.2 hours) and App/Play Store spend ($143B); the latter having a potential to double by 2024! As your team continues or increases their investment in your brand’s mobile app, having depth of visibility into the inner workings of your mobile applications and how users experience it is imperative. Whether it’s slow API responses, third party library dependencies, or the wild-west of Android devices, you can get to the root cause of end-user issues quickly. We’ll demonstrate how easy it is to get started with open-sourced and OpenTelemetry compliant libraries for iOS and Android, showcase how to monitor your app health and troubleshoot user-experience issues to reduce your MTTD.",
    "first_speaker": "Seerut Sidhu",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "S4U1525C",
    "title": "Mobilizing Technology Assets for Social Impact",
    "abstract": "For the first time, the 2021 World Economic Forum (WEF) Global Risks report includes the concentration of digital power and digital inequality among the top global risks. Income inequality, climate change, racial and gender inequity and the pandemic all intersect with and compound one another — and all these issues must make smart use of technology to make meaningful change in the world. Learn how technology companies leverage their product, charitable investments, employee talent and impact investments to be part of the solution. Learn from Splunk and key technology companies the importance of bringing all company assets to help solve social and environmental challenges.",
    "first_speaker": "Kriss  Deiglmeier",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "SEC1166C",
    "title": "Modernizing Security Operations With Splunk Security Maturity Methodology (S2M2)",
    "abstract": "Let's cut through the myths on what it takes to build a mature, effective Security Operations Center. Join this session to learn how to move up the Security Maturity curve with Splunk as your Security Operations platform by using a combination of people, process and technology. This session will detail how the Splunk Security Maturity Methodology (S2M2) will help your organization along your security journey; this is all about helping you operationalize your investment in Splunk. Our methodology will help you realize the value in your security investments that were not evident before. Learn how the collective experience at Splunk can be leveraged to build a new model of Security Maturity at your organization.",
    "first_speaker": "Paul Pelletier",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "TRU1548B",
    "title": "Monitoring Your Valuable Data in Splunk at Scale With TrackMe, The Easy Way!",
    "abstract": "Discover TrackMe for Splunk and learn how thousands of Splunk customers use it daily to monitor at scale the availability and quality of their data sources. TrackMe provides a key framework, extended with ML capabilities and dozens of rich features from a dedicated API to automated quality monitoring. More than just an application, TrackMe is the ideal companion for Splunk product administrators and owners to guarantee the value of Splunk as a company product. In this session, we will learn how TrackMe can help you make Splunk better to provide you with the perfect data source monitoring framework.\n",
    "first_speaker": "Guilhem Marchand",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "S4U1641C",
    "title": "Net Zero School: Case Study On Building an Energy Monitoring System for an Elementary School Using Splunk",
    "abstract": "Imagine using real-time data in Splunk to teach young school kids the pathway to a net-zero climate school. That’s what the Splunk for Good team of engineers and a grade school did together! Using Splunk Cloud Platform and the new Splunk Dashboard Studio Framework, young students are being taught how to manage, monitor and reduce energy use every day. The Splunk for Good team is helping this school meet its net-zero energy goal to produce as much energy as it uses. Learn from Splunk engineers how Splunk can be leveraged to make sustainable energy a hot topic in the classroom.",
    "first_speaker": "Ryan O'Connor",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "SEC1771A",
    "title": "Next Gen Rat Trap:  Evolving Sandbox Techniques for Malware",
    "abstract": "Advanced Threats are not new, and neither are the challenges they create for cybersecurity teams. Malware is increasingly aware and the amount of useful data gleaned from a simple sandbox is shrinking due to improved techniques to better target attacks and hide from analysis. Join us as we discuss how to integrate several dimensions of data (such as open source, certificate, passive and active DNS) and emulate a rich enterprise environment for malware interactions — ultimately allowing network defenders to collect valuable behavioral data & information and to create user-specified operating environments to prompt malware execution. We also show how to map this data to frameworks such as MITRE ATT&CK and apply proactive response actions.",
    "first_speaker": "Vincent Urias",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "SEC1703C",
    "title": "Normalize Threat Intelligence From Multiple Sources and Breakthrough Security Data Silos",
    "abstract": "Most organizations have invested in multiple premium or open-source threat intelligence feeds to inform critical functions within the SOC and incident management lifecycle. However, this data often sits in silos and is not easily integrated, making it difficult to operationalize. Learn how TruSTAR’s intelligence management capabilities plug-and-play normalized and scored intelligence data into your Splunk ecosystem of tools to overcome integration debt and improve security operations processes.",
    "first_speaker": "Elvis Hovor",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "TRU1713B",
    "title": "Now They See It, Now They Don’t: Role Based Access Controls and Data Filtering In Splunk",
    "abstract": "With Splunk Cloud Platform, Core, ITSI and ES, all having different capabilities, what do they all mean? Security demands \"Principle of Least Privilege,\" but as an admin, what does that mean for your deployment? In this talk, we'll go over the best way to structure and integrate your Splunk roles, access, policies and procedures, so that all your capabilities are right the first time. And as a bonus, we'll throw in some tips and tricks for processing sensitive data.",
    "first_speaker": "Charlie Huggard",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "DVO1565B",
    "title": "Observability As Code at Diligent",
    "abstract": "DevOps and IT teams use infrastructure as code to build, manage and automate infrastructure resources. In this session, learn how Diligent automates observability workflows – from provisioning to production. We'll discuss how we manage the lifecycle of Splunk Infrastructure Monitoring agents and provide observability as a service to internal teams leveraging HashiCorp Terraform to automatically generate observability assets such as url monitors, dashboards, detectors and alerts. Attend this session to learn how to reduce toil and consistently implement observability practices across different teams.",
    "first_speaker": "Michael Moore",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "DVO1818C",
    "title": "Observability for the Rest of Us",
    "abstract": "Observability is made possible by a new generation of monitoring technologies and techniques that combine the full-fidelity ingestion of metric, trace, and log data streams with AI technology to discover the patterns and causal mechanisms driving the behavior of modern digital services. It is generally believed, however, that Observability, while critical to the practice of DevOps and SRE communities, has little relevance to traditional IT operations and service management. This belief is incorrect. While interest in Observability was brought to a boil by DevOps and SRE concerns, it resolves many issues that have long plagued performance and event management even in legacy environments and, in fact, promises to enable convergence between the brave new world of highly modular, distributed, dynamic and ephemeral systems and the more structured and stable environments characteristic of legacy IT. ",
    "first_speaker": "Will Cappelli",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "DVO1377B",
    "title": "Observability From The Ground Up: Using OpenTelemetry and Splunk APM at Care.com",
    "abstract": "In early 2020, Care.com embarked on a platform modernization effort to move from monolithic applications to microservices.  It was decided from the beginning that observability would be a first-class principle in the new architecture.  With the announcement of OpenTracing and OpenCensus merging into a new standard named OpenTelemetry, and an invitation to become an early adopter of Splunk APM, this became an opportunity to build observability into the new platform architecture. Learn how Care.com built custom instrumentation libraries for our gRPC and Lambda services using opentelemetry-go and the importance of context propagation to enable end-to-end tracing between services running in Kubernetes and managed services like Lambdas.",
    "first_speaker": "Sean Schade",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "TRU1353B",
    "title": "Observability in the Art World: Utilizing RPi Sensor Data and APIs to Monitor Customer Engagement",
    "abstract": "When I’m not a Splunk architect, I draw charcoal portraits and create mixed media art. But for some of my artist friends, selling art is their primary source of income. I developed TheArtObserver for artists, co-ops and galleries to monitor customer responses using indexed social media, online sales and live customer behavior data. This data is collected using an infrared sensor, driven by RaspberryPi, which gauges patrons’ interest by measuring how long they spend looking at art pieces during live exhibits. In addition, TheArtObserver displays insights in well-designed dashboards and reports. The breakout session will explore the development of TheArtObserver.",
    "first_speaker": "Nadine Shillingford",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "DVO1537B",
    "title": "OpenTelemetry at Splunk and Google: How We Use It, How Our Customers Use It, and How You Can Use It",
    "abstract": "OpenTelemetry has established itself as the best and most popular way to capture signals from your applications and infrastructure so that they can be sent to backends like Splunk Observability Cloud and Google Cloud Ops for processing. This session will show real-world production examples of OpenTelemetry being used within Splunk and Google and amongst major customers. From this, you can see how to best deploy and manage OpenTelemetry at your organization and how you can gain deeper insights into the performance and status of your applications using tools from Splunk and Google.",
    "first_speaker": "Morgan McLean",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "PLA1462A",
    "title": "Optimize for Cheaper Storage & Search on the Splunk Cloud Platform",
    "abstract": "Are you looking to save money when it comes to storing and indexing data in Splunk that doesn't require ultra-performant search? Do you have data that you can't justify sending to Splunk because it's not \"worth it\"? Come hear how enhancements to the Splunk Cloud Platform can provide a significantly cheaper storage and search option designed for forensic investigation of unstructured and semi-structured data and data value discovery.",
    "first_speaker": "Aditya Tammana",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "SEC1661A",
    "title": "Optimizing Security Data To Speed Incident Detection and Response",
    "abstract": "Splunk Ninjas are always called upon to do more with less, and we are no exception. At TransUnion, we have a mandate to protect the security and integrity of our enterprise and doing that requires managing high volume data streams such as Sysmon. We are able to reduce Sysmon volume significantly while still maintaining data quality and matching against millions of IOCs in real-time to enrich the data in motion. In this session, we’ll show approaches that allowed us to remove noise, enrich the data stream on ingest using Threat Intel providers such as BitSight, make real time routing decisions on these sources at scale and then push this data to Splunk with the right form and format.",
    "first_speaker": "Padraic Canavan",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "DVO1498C",
    "title": "OTel Me Why",
    "abstract": "OpenTelemetry is an open-source and vendor-agnostic solution to instrument and collect telemetry data, including metrics, traces and logs. Splunk Observability Cloud supports the OpenTelemetry standard, and Splunk customers love it! In this panel discussion, hear direct from Splunk customers on how OpenTelemetry has helped them better observe their systems while avoiding vendor lock-in.",
    "first_speaker": "Tyler Jago",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "S4U1577C",
    "title": "Our Neurodiverse Journey: Why Workplace Mental Health Matters More Than Ever",
    "abstract": "Even before the pandemic, around a fifth to a quarter of the population experienced anxiety, depression, or other mental health conditions. Since March 2020, those numbers have grown, and the resulting mental health crisis has impacted workplaces of all sizes. Organizations are creating mental health communities such as Employee Resource Groups that help employees connect and find support to address these issues. Using our story as a blueprint, we’ll tell you how to do it — how the Splunk Neurodiversity ERG got its start, the challenges we encountered and the next steps for us in a post-pandemic world. We’ll conclude by discussing how Splunk and the broader industry are working to reduce stigma and make real changes to workplace mental health.",
    "first_speaker": "Jeff Spencer",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "PLA1291B",
    "title": "Porsche AG: Need for Speed",
    "abstract": "Data Streaming is a very important part of Porsche's IT strategy. In 2019, Porsche started work on its new central data streaming platform dubbed Streamzilla, which is based on Apache Kafka and NiFi. The aim was to minimize support costs, prevent future data loss and provide all product teams at Porsche with an optimal data streaming platform — whether in development, production or customer service, creating an overall customer-centric data streaming service. This successfully enabled many new ideas and new use cases to be adopted and implemented quickly. Here we'll talk about how Splunk helped us, especially in the early days of the platform, to monitor logs, detect patterns and make swift changes while in production.",
    "first_speaker": "Isabelle Park",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "SEC1163A",
    "title": "Proactive Risk Based Alerting for Insider Threats",
    "abstract": "Insider threats are some of the most insidious, yet every organization is vulnerable. It’s time to take charge! Most organizations deal with these threats by dropping in a DLP-type solution and calling it a day, but these tools are extremely limited in their capabilities and often provide more noise than true positives. \nSo how do we solve one of the most prevalent but often overlooked threats? The answer is Risk-Based Alerting! In this session, participants will learn how to identify which threats matter to their organization (threat matrix on GitHub), build quality detections using the RBA framework, and automate responses to Insider Threats. \nBut wait, there’s more; you will also learn how RBA saved Christmas!\n",
    "first_speaker": "Matt Snyder",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "DVO1179B",
    "title": "Progressive's Journey to Observability; From Hand-Rolled To Shrink-Wrapped",
    "abstract": "Observability has been a buzzword for over a year, but what would you have done before that?? At Progressive, we had logs and metrics in Splunk but saw the need for full fidelity tracing before OpenTelemetry was a thing. Join this session to learn how you can get tracing in everything from old school monolithic applications deployed to on-prem physical servers, all the way to auto-instrumenting your microservices to run in a containerized environment. By mixing hand-rolled solutions to support the old stuff along with modern shrink-wrapped solutions for the new stuff, Progressive is able to capture the full spectrum of applications.",
    "first_speaker": "Tyler Jago",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "ITO1416B",
    "title": "Question: Why Is the Wireless Network Always So Slow?",
    "abstract": "WiFi Network Engineers understand contributing factors of a slow wireless network – oversubscribed AP’s; misconfigured clients; cross channel interference, etc. – but, at times, it's difficult to translate what is going on at a high-level. Moreover, in a pre-Splunk world, there can be times when even WiFi Network Engineers struggle to understand the WiFi *Big Picture (*forest) due to the many *distractions (*trees) the massive amounts of data presents. Using a forest analogy, Splunk provides a similar capability that LiDAR (Light Detection & Ranging) can offer geologists & archeologists, who, with the aid of LiDAR, can get a detailed view of the landscape without the obfuscated view through countless trees! Splunk Reveals The Truth!",
    "first_speaker": "Michael Kent",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "PLA1248C",
    "title": "Realogy and Splunk: How We Prevent Log Roll Over With Persistent Queuing on Heavy Forwarders",
    "abstract": "Splunk can ingest a near-infinite amount of log sources that all come with their own unique challenges. Configuring and monitoring log caches and disk space on tens of thousands of devices is not always in the deck of cards. This session will discuss the architecture and the ins and outs of setting up a Heavy Forwarder to act as a large central persistent queue. If you have chatty domain controllers and member servers, this session may be for you. I will show you how not to get popped by an auditor and what it takes to have a defendable plan. We will also discuss how best to test your plan so we can make log rollover and data loss a thing of the past. This topic could not be complete without some SYSLOG talk — we will also cover some tips.",
    "first_speaker": "Brett Fernicola",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "SEC1546A",
    "title": "Reduce Noise  From Intel Sources With TruSTAR + Splunk ES RBA ",
    "abstract": "Industry reports on security operations practices cite high false-positive rates and noise from threat intelligence feeds as a top issue affecting security analyst productivity. We will highlight how you can leverage TruSTAR and Splunk ES to reduce the noise from your intel sources and ultimately improve alert prioritization processes using internal and external intelligence without working within multiple tools.",
    "first_speaker": "Elvis Hovor",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "SEC1828",
    "title": "Reduce Risk with Analytics-Fueled, Automation-Driven and Cloud-Delivered Security (AMER) ",
    "abstract": "Are you on pins and needles because you can’t keep up with the explosive growth of new threats and you don’t want to be in tomorrow’s headlines? Are you experiencing gaps in visibility as the attack surface continues to expand due to both cloud migration and remote work? Hear from leading security experts, CISOs, and customers about how you can reduce risk with an analytics-fueled, automation-driven and cloud-delivered security solution with Splunk. In this session you will learn how to overcome common security challenges and enable your teams to drive faster MTTD and MTTR. Learn from Splunk’s VP of Security Products, Jane Wong, President and CEO, Doug Merritt, CISO, Pamela Fusco, special guest Kevin Mandia, CEO of Mandiant about how Splunk can help you digitally transform your business and accelerate your journey to the cloud with data, analytics, threat intelligence, and automation.",
    "first_speaker": "Doug Merritt",
    "start_time_utc": "2021/10/20 16:00:00",
    "end_time_utc": "2021/10/20 17:00:00"
  },
  {
    "session_code": "PLA1266A",
    "title": "Reimagine Data Visualization with Splunk Dashboard Studio ",
    "abstract": "Splunk Dashboard Studio reimagines how you build dashboards with an intuitive user experience and new out-of-the-box visualization capabilities that can take your Splunk dashboards to the next level. Learn about the latest and greatest features that will help you to create clear, compelling and meaningful dashboards. Don't just rebuild your Classic dashboard in Studio; unleash the full potential of Dashboard Studio to help you bring data to everything. If you plan to attend any other Dashboard sessions, we recommend you start here.",
    "first_speaker": "Lizzy Li",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "SEC1440A",
    "title": "Risk-Based Response: Maturing your Security Operations With Risk Awareness and Splunk SOAR (Phantom)",
    "abstract": "Want to see how you can greatly reduce manual investigations of false positives, saving time and effort, and respond to malicious activities quicker? With Risk-Based Response, Adarma and HSBC will show how you can better automate the prioritization of Security Events to bring the known bad and suspicious to the forefront and leave the false positives untouched by Analysts’ eyes. \n Taking advantage of established data points from SIEMs, internal or external APIs, even existing investigations, Splunk SOAR (Phantom) can standardize your understanding of risk at any level. We will show how to reduce mean dwell time for security events, plus make speedier and more accurate decisions using dynamic risk-based decisions for your Splunk SOAR automation.\n",
    "first_speaker": "Tom Wise",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "PLA1679A",
    "title": "Salesforce + Splunk: A Journey of Scaling & Adoption",
    "abstract": "This session provides a brief history of Salesforce’s usage of the Splunk platform, log volume growth, usage maturity and scaling challenges. As part of the Monitoring Cloud team, we want to hide all the complexities from our users and ensure the required performance so users can get insight from data in troubleshooting and root-cause analysis.\n We will talk about our scale (10x in the last couple of years), growth (indexing few hundreds of terabytes a day), migration to the public cloud, adopting new Splunk features and our learnings over the journey. In this session, we will share our tunings and tactics to create a highly trusted, reliable, performant platform and how we plan to architect for another 5x-10x growth.\n",
    "first_speaker": "Nagraj Kulkarni",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "ITO1564B",
    "title": "Scaling Kubernetes With Splunk and AWS",
    "abstract": "As you move beyond dev/test to roll out Kubernetes across your organization in production, you'll find that while Kubernetes provides the agility for development teams, it also introduces operational complexity and monitoring challenges.\n \n In this session, experts from Splunk and Amazon Web Services (AWS) will present how to efficiently scale Kubernetes applications with Amazon Elastic Kubernetes Service (EKS). You'll also learn how to gain observability into your entire Kubernetes environment with Splunk, no matter where you choose to deploy Kubernetes clusters – cloud native on AWS, hybrid cloud or on-premises.\n",
    "first_speaker": "Amit Sharma",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "PLA1540A",
    "title": "Seamlessly Search Your Data Wherever It Lives With New Splunk Federated Search",
    "abstract": "Want to seamlessly search your data in cloud or on-premises? Turn data into doing faster than ever before with an intuitive, unified search experience requiring less data movement and IT resources. Explore the new Splunk Federated Search capability that lets you search across multiple Splunk environments from both Splunk Cloud Platform and on-premises with ease. Unlock brand new, cross-functional insights by breaking down data silos, all while managing security requirements with role-based data access controls. Adapt your Splunk environment and data searches free of barriers to meet your evolving data needs. Join to learn more about efficiently searching across Splunk data stores, and how to easily configure and set up with the self-service intuitive interface.",
    "first_speaker": "Srinivas Bobba",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "DEV1147C",
    "title": "Secrets From the Developer Kitchen - Develop On Splunk Like a Pro With UCC, Visual Studio Code and Git",
    "abstract": "Do you want to learn the pros' and insiders' secret development techniques? Do you want to learn how to use tools like Visual Studio Code to build, debug and inspect code? What about using Git and CI/CD workflows? If you answered \"yes\" to any of these questions, this session is for you! Learn how to use Universal Configuration Console (UCC) to generate flexible user interfaces for your add-ons, just like Splunk built apps on Splunkbase. Discover how VSCode can help debug code, preview UI and inspect code for best practices. But wait, there's more! If you have previously built add-ons with Add-on Builder, you'll learn how to convert from a single developer tool to a multi-developer collaboration. Let's get developing like a pro!",
    "first_speaker": "Tom Martin",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "SEC1638A",
    "title": "Securing Science: Risk Based Vulnerability Management Leveraging Splunk",
    "abstract": "In 2020 over 18,000 vulnerabilities were tracked by the National Vulnerability Database. Of those vulnerabilities, over 4000 were classified with a HIGH severity rating. \n \n For a leading global biopharmaceutical corporation at the forefront of Covid-19 vaccine development, vulnerability management is a key pillar to the success of our cybersecurity initiatives. Join us to learn how we transitioned from traditional vulnerability reporting and management to a more informed and efficient, risk-based approach using Splunk.\n \n We will present traditional challenges faced by vulnerability and risk teams, how early initiatives were implemented and how the program has matured, paving the way for faster and more focused company-wide remediation efforts.\n",
    "first_speaker": "Josh Diakun",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "SEC1222A",
    "title": "Security Triage in the Real World: The Rubber Hits the Road",
    "abstract": "It's hard enough to gather logs and formulate use cases, but once your masterful detection apparatus is running, how do you manage the flow between suspicious activity and incident investigation? How do you group related events? How do you handle repeat activity? This talk will get down and dirty in the world of SOC analysts grinding it out on the front lines. We’ll share some approaches to organizing and correlating alerts as well as some dashboards and architectural choices we've made to help our analysts get the most out of Splunk.",
    "first_speaker": "Trevor Ford",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "TRU1653B",
    "title": "Security With Pizzazz",
    "abstract": "Are your security dashboards feeling old? Do they need a refresh to keep the security team interested? We’ll walk through ways to convert your existing security dashboards to high-functioning—and good-looking—dashboards using Splunk Dashboard Studio. We’ll also explore creating better searches using metrics and machine learning to bring your efforts into this decade. These techniques will focus on security, but the methods will apply to any use cases.",
    "first_speaker": "Michael Simko",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "PLA1458A",
    "title": "Seeing is Believing: Teaming to Bring Video AI/ML Innovation Into Splunk",
    "abstract": "Organizations everywhere are using video analysis in many aspects of their business. While this increase in video capture might be an operational necessity, it has been difficult to ingest that data into Splunk...until now. Join World Wide Technology, Dell and Intel as they share their collaborative solution that brings the AI inference data from video into Splunk - unlocking a new world of high value use cases across every industry - and see how Splunk’s investigative data platform is cast into an exciting new role.",
    "first_speaker": "Alex Rodriguez",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "DVO1054C",
    "title": "Seeing RED, Using USE: Why Monitoring Patterns Matter",
    "abstract": "As our applications and infrastructures have become more complex, the onslaught of data can seem overwhelming. Metrics, traces, and logs come at us from clouds, from hundreds of microservices, ephemeral serverless functions, and intertwined messaging like Kafka or service meshes. We need to monitor these environments with accuracy and a common language that can cross users’ spectrum from Ops to Devs. Monitoring patterns like RED (Rate-Errors-Duration) and USE (Utilization-Saturation-Errors) help bring our data into a clear picture without losing flexibility or compromising data integrity. Come find out how RED and USE can give you the monitoring you need to keep things running and deliver production quality for users.",
    "first_speaker": "Nicolette Graham",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "ITO1306C",
    "title": "Seven Habits of Successful Operations Teams That Use AIOps",
    "abstract": "Getting asked to do more and not getting any budget? Operations teams can't afford to manually respond to every alarm and find/fix every single incident. AIOps solutions help operations teams accelerate how quickly they can find and fix problems by relying on artificial intelligence and automation rather than manual effort. Using a more analytical and automated approach, operations teams can squash their MTTRs and improve service delivery outcomes. Join this session to learn about the latest Splunk AIOps technologies and best practices from customer deployments for how to get the most out of AIOps solutions.",
    "first_speaker": "Will Cappelli",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "SEC1742C",
    "title": "SIEM, SOAR and XDR...Which One?",
    "abstract": "Do you really have to pick? Why not all three? Is one better than the other? The market is flooded with great security tools, so how do you know which ones you need and what for. Come with us and we'll demystify these three technologies and show you how they actually complement each other and how you ensure you can realize the full benefits out of everything on offer. As much as the technology we have to choose from is designed to provide maximum capability with minimum effort, there is still the ever-important people and process part of the equation that needs to be considered and clearly defined. So irrespective of your organization's size or maturity level, what are the right steps for you to follow to build a world-class SOC.",
    "first_speaker": "Paul Pelletier",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "PLA1467A",
    "title": "Simplify Getting Data In with Splunk Cloud Platform",
    "abstract": "Sometimes “getting data in” can be just as complicated as managing the data itself. Splunk is eager to help you accelerate your transition to the cloud by making these processes simplified and more streamlined. Join us to learn about how new innovations with the Splunk Cloud Platform will help you get to the cloud faster, while making your data work for you. Built for Splunk Cloud, Stream Processor Service is designed for filtering noisy data, enrichment and formatting of raw data, statistics & analytics on data in motion, and routing to your various data destinations. Come join us to learn how Stream Processor Service and other cloud native capabilities will make getting data to the right location in the right shape as simple as G-D-I. Join us to see this in action and learn how you can take your cloud data experience to the next level!",
    "first_speaker": "Aditya Tammana",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "PLA1753A",
    "title": "Sneak Peek of the All New Search and Dashboard Experience That Will Dramatically Enhance Your Time-to-Insight",
    "abstract": "We've been hard at work COMPLETELY redesigning our core Splunk Cloud experience! Join us for a comprehensive overview and live demo of our brand-new Search and Dashboards. Learn how new users can write searches without knowing a single line of SPL, how advanced users can kill the extra browser tabs by building multistatement searches with the power of SPL2 and how all insights can be collected in a completely integrated dashboard experience.",
    "first_speaker": "Faya Peng",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "ITO1393C",
    "title": "SNMP - The 90s Want Their Network Management Back!",
    "abstract": "In this session, we'll focus on the good, the bad and the ugly of onboarding SNMP data into Splunk. We'll showcase the new Splunk Connect for SNMP, a highly scalable massively redundant container-based onboarding solution and we'll dive deep into processing SNMP traps and enterprise-wide SNMP polling. We'll also cover different deployment scenarios and implementation best practices. If you have a network and care about its performance, you don't want to miss this session.",
    "first_speaker": "Ryan Faircloth",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "SEC1238B",
    "title": "SOAR High Like a BOSS and Stop Internal DDOS",
    "abstract": "Are all the events you want in Splunk SOAR ending up there? This session will walk you through the strategies to help you achieve an event ingestion success rate of 100% while reducing the possibility of unintentional internal Denial of Service impacts. Join Patrick Gibson and Taylor Shattuck from Huntington National Bank to learn how to provide a robust ingestion process in a multitenancy environment that reduces impact to downstream integrations and platform users. \n Techniques include:\n • Implement monitoring to catch missed events\n • Status changes on notable events to facilitate monitoring\n • Event ingestion throttling and interval tuning\n • Custom list environment variables for flexibility \n • Switch from a push to a pull model\n",
    "first_speaker": "Patrick Gibson",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "PLA1621B",
    "title": "Solving ML Problems With Splunk Machine Learning",
    "abstract": "Do you want to learn how to use machine learning to unlock the secrets of your data? Are you interested in seeing how real-world problems can be solved using machine learning without lots of complex math? By using Splunk Machine Learning Labs beta, the University of Arizona has improved student retention, reduced fraud and cut costs. All of this is done without the heavy lift of spending six months learning algorithms, data science, statistics or calculus. Learn how U of A went from zero to ML hero by using Splunk Machine Learning!",
    "first_speaker": "Paul Reeves",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "ITO1176C",
    "title": "Splunk and Your CMDB - Getting the Best of Both",
    "abstract": "How can you leverage the data you already have in CMDB? Have you ever wanted to use the data you have in your CMDB to enhance your monitoring strategy? How can you operationalize your CMDB data with Splunk?\n \nA Splunk and CMDB integration lets you minimize complexity and streamline the overall user experience by implementing a solution that easily integrates two industry-leading IT platforms. The attendee will learn how to integrate CMDB data with Splunk IT Service Intelligence by integrating the service topology and CI information that the CMDB holds. In addition, the attendee will learn how to incorporate data from both the CMDB and Splunk Infrastructure monitoring sources to have a single lens into all the data in an organization.\n",
    "first_speaker": "Kirk Hanson",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "DEV1307C",
    "title": "Splunk Cloud Platform and Self-Serviceable Apps - A Love Story",
    "abstract": "We know managing apps at scale in Splunk Cloud Platform can be a challenge: navigating support tickets, integrating with Splunk AppInspect, dealing with manual app vetting and managing all the other things that get in the way of shipping value to your users. So, we've been listening closely and working hard with you, our customers, to make managing your app lifecycle in Splunk Cloud Platform as simple and self-serviceable as possible. \n \nWe will take you through some Splunk Cloud Platform app management history as well as showcase some new tools and features you can take advantage of today. Go from deploying apps in days down to minutes in Splunk Cloud Platform and fall in love with apps all over again!\n",
    "first_speaker": "Kyle Champlin",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "PLA1510C",
    "title": "Splunk Cloud Platform Compliance World Tour!",
    "abstract": "Join a chat where we span the globe covering the most common compliance and regulatory regimes that are supported by Splunk Cloud Platform. We will discuss the responsibilities that Splunk can help you meet and which responsibilities still belong to you as a customer. This talk will cover compliance in every region where Splunk Cloud Platform is currently available.",
    "first_speaker": "Brad Staszcuk",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "S4U1169C",
    "title": "Splunk Cloud Platform Lessons Learned from Splunk@Splunk",
    "abstract": "The Splunk@Splunk team runs one of the largest Splunk Cloud Platform environments in the industry, and with that, at times, come many challenges. We're here to share what we’ve learned on how to scale and maintain a large environment with high availability. You’ll hear about some of the problems that we've faced and how we've overcome them. This is a session you wouldn’t want to miss.",
    "first_speaker": "Clara Merriman",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "SEC1332C",
    "title": "Splunk Enterprise Security Biology V: A Fresh Look at the Threat Intel Framework",
    "abstract": "In 2017, I took a deep dive into the threat intel framework and with the continuing evolution of Splunk Enterprise Security, it is time to take a fresh look at the framework. This session will examine how indicators can be integrated and what occurs below the surface in ES to prepare them for consumption and correlation. To illustrate how indicators can be consumed by the framework, examples from partners will be used, highlighting differences in approaches and pros and cons. Because the framework is designed to operationalize threat intelligence within ES, the session will wrap up with tips and techniques to quickly ingest indicators that attendees can use in ES immediately.",
    "first_speaker": "John Stoner",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "S4U1049B",
    "title": "Splunk@Home:  How To Create Your  Own Training Rig Using Data In Your Home!",
    "abstract": "The volume of data available in our homes is significant! Not only can we use this data to save ourselves time and money, but we can also use this as a great way to create our own training environment. From data onboarding to dashboarding, we will show you how to build and use your own environment to boost your Splunk skills using your own data. And how you can use that data to plan your next smart home automation.",
    "first_speaker": "Thomas West",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "S4U1104B",
    "title": "Splunking For Inclusive Language: How We Replace Biased Terms in Our Products",
    "abstract": "Hear from a cross-functional team at Splunk about how we removed biased language from hundreds of code repositories and documentation pages. The presenters will discuss the origin of the effort, the progress they have made since 2020, and how they use developer automation, continuous integration and Splunk software to reinforce cultural change and monitor progress. Please attend to learn how you can bring this effort to your own workplace.",
    "first_speaker": "Christopher Gales",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "DVO1712B",
    "title": "Splunk Log Observer - Log Investigations Designed for Observability",
    "abstract": "Log investigations across use cases and departments are not the same, which is particularly true in DevOps teams. Developers need to rapidly find the logs that will help them debug problems and SREs and platform teams want to get real-time insights into how application and infrastructure changes affect performance. Meet Splunk Log Observer. Part of the Splunk Observability Cloud, Splunk Log Observer, offers a new experience that tightly connects logs with related metrics and traces while providing new ways to quickly explore logs and find incoming problems in real time. In this session, we'll walk through how Splunk Log Observer works, show you Splunk Log Observer in action and what you can do to get started.",
    "first_speaker": "Bill  Emmett",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "PLA1452B",
    "title": "Splunk Operator for Kubernetes — Cloud Native Splunk Enterprise Overview",
    "abstract": "Kubernetes has become the de-facto standard for public and private cloud container orchestration. In this session, we'll look at what Splunk Enterprise looks like running in a distributed containerized deployment. We'll start with the platforms we develop and work with most frequently. Then move onto sizing and performance considerations. We'll delve into basic setup and cluster definition and conclude with methods for monitoring and scaling your cluster.",
    "first_speaker": "Patrick  Ogdin",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "DEV1595B",
    "title": "Splunk + React = :Mindblown:",
    "abstract": "Last year, we got a glimpse of Splunk and React working together in harmony to create powerful applications that move beyond the dashboard paradigm. We heard your oohs and ahhs through the screen, and this year, we will continue breaking the barrier between a single page application and a Splunk app, showcasing custom 2D and 3D interactive visualizations, spring animations for fluid UIs and responsive styling, all natively in Splunk. Come learn more about the technology that powers a new generation of mission cybersecurity applications at NASA’s Jet Propulsion Laboratory.",
    "first_speaker": "Aprameya Mysore",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "DVO1227B",
    "title": "Splunk Real User Monitoring – Every Second Counts",
    "abstract": "It’s very clear, customers abandon poorly performing applications. However, as engineering teams use DevOps and microservices to deploy faster, they also face blind spots and wider surface areas when troubleshooting customer-facing issues. Regardless of title, DevOps engineers, site reliability engineers, and front-end developers alike need visibility of how an entire distributed system impacts their end-user experience. Join Shashwat Sehgal, Splunk senior group product manager, as he demonstrates how Splunk’s open source built, OpenTelemetry standardized Real User Monitoring (RUM) solution provides end-to-end context from web browsers through backend services. You’ll understand how to measure the end-to-end impact of system performance on end-user experience, how to easily prioritize your most severe customer-facing issues, and how Splunk RUM’s open source, OpenTelementry standardized instrumentation adds value as you modernize your applications.",
    "first_speaker": "Shashwat Sehgal",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "SEC1727A",
    "title": "Splunk Security Analytics for AWS: A Force Multiplier for Lean Security Teams ",
    "abstract": "Splunk Security Analytics for AWS is a new offering designed to make detection and investigation easier for smaller security teams. It leverages out-of-the-box AWS integrations to empower lean Security and IT teams to quickly detect, triage, and respond to security incidents in their AWS footprint. AWS customers can rapidly bring security-relevant AWS data, such as automated risk indicators from AWS Security Hub, logs from AWS CloudTrail and notifications from Amazon GuardDuty into Splunk for cloud-wide correlation. Join us to learn how Splunk Security Analytics for AWS makes data onboarding, detection, investigation and response in AWS environments as seamless and simple as possible, providing immediate visibility and enhanced protection.",
    "first_speaker": "Vinay Sukumar",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "SEC1643A",
    "title": "Splunk Security Essentials: An Approach to Industry Threat Detection Engineering ",
    "abstract": "Are you struggling with deciding which security detections to implement in your environment? Do you find it difficult to keep track of which Threat Groups are targeting your industry? If you answered yes to any of these questions, then this talk is for you. Using Splunk Security Essentials (SSE), we will leverage the MITRE ATT&CK Framework and showcase how you can go from an Industry to the associated Threat Groups that target that Industry to the techniques that these groups are likely to use. To close it off, we will then showcase how to find and enable detections linked to the most popular attack techniques. This approach is a very effective way of crafting a good starting security posture for any organization that doesn't know where to go next.\n",
    "first_speaker": "Johan Bjerke",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "SEC1301C",
    "title": "Splunk SOAR: Automation for the Modern SOC",
    "abstract": "The security operations center (SOC) is overwhelmed. Analysts are drowning in security alerts. Security operations work is rife with monotonous, repetitive tasks. And mean time to detect, triage and respond to threats is still too slow. So, stop being overwhelmed and get in control! Splunk SOAR (Phantom) provides security orchestration, automation and response capabilities that empower your SOC to automate repetitive tasks, increase analyst productivity, and triage security incidents in seconds. In this session, Splunk security experts will provide a deep dive into the benefits of  Splunk SOAR and provide demos showing how Splunk SOAR solves common security use cases.",
    "first_speaker": "Philip Royer",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "TRU1636B",
    "title": "Splunk SOAR Playbooks at Scale Or: How I Learned To Stop Worrying and Love the SOAR",
    "abstract": "Stepping into the Splunk SOAR world for the first time can leave you feeling lost and unsure of what direction to drive. Or perhaps playbooks you write are starting to grow repetitive, large and unwieldy, or both. The XDR Automation team at Accenture Federal has paid the iron price for quite a bit of know-how surrounding matters like this and we would like to pass this knowledge to you to make your SOAR life a bit better. The talk aims to provide you the scaffolding to build your automations effectively and what considerations to take when building a \"container lifecycle.\" We will also talk about some tips and tricks for playbook development in the Splunk SOAR VPE you may not be aware of that will help you on the way to greatness.",
    "first_speaker": "Greg Rivas",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "PLA1827",
    "title": "Splunk, Your Partner in the New Hybrid Era of Cloud Transformation (AMER)",
    "abstract": "Data is everywhere; your platform should support your data no matter where it is. For all of your Security and Observability needs, Splunk provides a unified platform that is reimagined for a new hybrid era of cloud transformation. Come hear about how the Splunk platform is built for the hybrid world so you can thrive no matter where your data lives. Learn from Splunk’s Vice President of Product Management, Josh Klahr, and Sr. Director of Product Management, Faya Peng, about how Splunk platform is innovating to give you visibility from edge to cloud, advanced investigation for rapid action, and the ability to customize the way you want.",
    "first_speaker": "Faya Peng",
    "start_time_utc": "2021/10/19 18:00:00",
    "end_time_utc": "2021/10/19 19:00:00"
  },
  {
    "session_code": "S4U1507B",
    "title": "Splunk Your Retail Business Data to Empower Your Workers",
    "abstract": "Ever wonder what impact each of your retail store employee’s daily actions has while working within the Inventory Management System platform? Whether they are picking or binning, labeling or price changing, auditing or executing item counts, each task’s data matters! Knowledge is power, and Splunk gives you just that — power. Turn the data into knowledge to empower your business and employees by creating reports and dashboards!",
    "first_speaker": "Prasanth Balachandar",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "TRU1421B",
    "title": "Study Club for Splunk > Brain Turbo Charging > Let’s Demystify BTOOL & BTPROBE",
    "abstract": "This session will rev your knowledge on two of the most critical utilities for Splunk success, namely BTOOL and BTPROBE. You simply must come to this truly inspiring session. We promise you will leave happy, energized and amped to learn even more with Study Club for Splunk. Your best 30 minutes at .conf21. Study Club for Splunk is a free community initiative born from SplunkTrust members. Its mission is to support learning, knowledge sharing and skills by creating intuitive, easy-to-use building blocks, including associated areas such as Linux, AWS, Scripting, Agile, etc. Underpinned by real-world best practices, we share code repositories, validated R&D, guidance and support. Let’s energize Splunk community journeys with added vroom vroom.\n",
    "first_speaker": "Aleem Cummins",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "CUS1825",
    "title": "Success on Every Step of Your Journey (AMER)",
    "abstract": "As businesses digitally transform and IT and Security challenges become more critical, organizations need strategic partners to provide guidance every step of their journey. Whether you are prepping and securing data, considering migrating to Cloud, or seeking post-cutover support - our CS team has been there. Join us to hear from our SVP of Global Services Toni Pavlovich and SVP Adoption & Retention, Katie Bianchi on how Splunk with a thriving community of practitioners and partners has helped customers accelerate deployments, optimize solutions and successfully manage migrating to the Cloud.",
    "first_speaker": "Toni Pavlovich",
    "start_time_utc": "2021/10/19 18:00:00",
    "end_time_utc": "2021/10/19 19:00:00"
  },
  {
    "session_code": "SEC1162A",
    "title": "Supercharge Your Risk Based Alerting (RBA) Implementation",
    "abstract": "By now you have heard of RBA and may be even implementing it. Are you running into any problems? This session will address some common questions and give you tips and tricks on how to make RBA even more powerful. For examples:\n - How to decide on the alert threshold?\n - How to integrate RBA with Splunk SOAR?\n - How to combat repeating \"benign\" offenders?\n We will review examples of incorporating Splunk UBA (User Behavioral Analytics) and Microsoft security alerts into RBA.",
    "first_speaker": "Teresa Chila",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "PLA1857",
    "title": "Supply Chain Control Tower - Driving Intelligent Execution for Clients",
    "abstract": "A Control Tower isn't just a visibility layer, but also a set of capabilities to address complex business problems in the Supply Chain arena. A few of the integral capabilities to building a robust solution include end-to-end visibility, Performance Management, Predictive Alerts, Intelligent Response, Optimization & Orchestration. Within the solution space, Splunk is an important facet of the value proposition to our clients by providing an 'innovation as a service' model to address problems quickly, grow proficiency and scale the business and supporting technologies. Please tune in to see how Splunk and Accenture are delivering results in Supply Chain.",
    "first_speaker": "Matthew Widdowson",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "DVO1253C",
    "title": "Synthetic Monitoring and Single Page Apps: How To Increase Control, Visibility and Performance",
    "abstract": "For web developers or SREs leveraging Single Page Applications, client-side rendering can create challenges of control, visibility and understanding user experience. Modern synthetic monitoring promises deeper understanding and visibility into the user experience in pre-production and after deployment. Join Developer and Technology Advocates Tetiana Kelly and Scott Mason as they discuss how they leveraged synthetic monitoring to identify performance improvement opportunities for Splunk’s global SPA, The Quest for Observability. From measuring user experiences across geographies to compression and image optimization opportunities, this talk provides best practices and lessons learned to help engineers deploy better SPAs.",
    "first_speaker": "Tetiana Kelly",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "SEC1528C",
    "title": "Tackling Account Management Within the Cloud (AWS, Azure and GCP) With Splunk SOAR",
    "abstract": "Our distinguished Splunk SOAR engineer, Philip Royer, will walk you through three simple automated playbooks that you can use to monitor misuse of account privileges, new account creations, and any other abnormal account behavior. These playbooks will help your business create a line of defense in preventing bad actors from infiltrating into your systems within the cloud. Join us to learn how you can use these pre-built playbooks today!\n Learning Objectives:\n 1. Learn how to use automation and orchestration to monitor abnormal behavior in cloud accounts.\n 2. Learn how to investigate and respond to unusual account usage in the cloud.\n 3. Learn how to use pre-built playbooks in your environment.\n",
    "first_speaker": "Philip Royer",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "DVO1603B",
    "title": "The Challenges and Solutions for Modern Infrastructure Monitoring and Troubleshooting",
    "abstract": "As cloud-native infrastructure rapidly proliferates, ITOps, DevOps and SRE teams face a sprawling complexity in their environment. It makes easier, faster, more reliable and scalable infrastructure monitoring and troubleshooting even more critical and hard. To get visibility across your environments, to see how problems in one part of your stack affect another, customers had to use different tools or jump from one screen to another, with critical time wasted. The skyrocketed volume of objects makes efficient monitoring and accurate alerting even harder. Speed and scale are the greatest assets in monitoring and maintaining your modern infrastructure. Attend this session to learn how we address these challenges for our customers with Splunk Infrastructure Monitoring.",
    "first_speaker": "Zongjie Diao",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "DEV1050C",
    "title": "The Developers Starter Kit!",
    "abstract": "Whether it's creating custom python scripts, adding your own search commands, making your dashboards look extra awesome! We will take a look at some of the fundamental parts to be a Splunk app developer and show you how you can do all these things, plus a whole lot more!",
    "first_speaker": "Thomas West",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "SEC1787A",
    "title": "The Future of Splunk Security Cloud Behavioral Analytics",
    "abstract": "Cloud services offer many operational benefits to security teams. They allow your team to focus on high-value tasks, yield fast time-to-value and make it easier for your team's operations to scale, among other benefits. With Splunk Security Cloud, you receive all the advantages of Splunk's Security Analytics and SOAR technology along with those that come with cloud service delivery. In this session, we'll provide an overview of Splunk Security Cloud and how it brings together best-in-class Security Analytics, Splunk SOAR, collaboration tools and continuously updated threat research, all in the cloud and with straightforward, predictable pricing.",
    "first_speaker": "Patriz Regalado",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "SEC1533A",
    "title": "The Must-Have Security Arms in the Cloud Journey - Splunk SIEM and UBA",
    "abstract": "As MSS security consultants, we will be sharing our experience on why implementing cloud security using SIEM is an indispensable mission of every organization’s journey to the cloud and how it becomes obvious that monitoring their assets and user activity is an essential requirement. As organizations enlarge their cloud footprints across infrastructure as a service (IaaS) and platform as a service (PaaS) capabilities that span multiple accounts and regions and grant privileged access to multiple users across this massive landscape. We will share how SIEM and UBA’s approach of incident detection to ensure cloud security is inevitable.",
    "first_speaker": "Prabhu Ravi",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "PLA1738C",
    "title": "The Power of Industrial Manufacturing Monitoring and Analytics That Drive Innovation and Efficiencies for Lockheed Martin",
    "abstract": "Imagine the cost and lost productivity that manufacturing plants face when one of their machines that manufactures helicopter gears is brought down for unplanned maintenance and requires weeks of downtime waiting for an overseas part. This is why Lockheed Martin has implemented a multisite monitoring and maintenance application with Splunk to improve avoidance by capturing and acting on such events. Come and hear IT best practices for integrating operational machine and sensor data from plants across the U.S. with maintenance data from systems like SAP and information asset management tools. Splunk provides insights for all levels of engagement — from capital asset planning to finite improvements of maintenance schedules.",
    "first_speaker": "Christopher Gilman",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "DEV1463B",
    "title": "This API Is Legit, It Needs a Splunk Add-On!",
    "abstract": "As Splunk users, more data means more valuable insights and outcomes. There are always more data feeds, user interfaces and tools! We have feeds we pay for that did not have Splunk apps or API integrations that met our needs. So, in true developer fashion, we made new commands and apps for Splunk. Now, integrating the API, merging the results with data and building useful dashboards is accessible to all organizations. \nIn this session, we will run through the tools and commands we built in, how we merged with traditional data and some dashboards that are now core to our threat hunt efforts. The data feeds we will focus on are Shodan, social media, Hunter.io, and some tweaks to the Domain Lookup.\n",
    "first_speaker": "Daniel Radke",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "SEC1205B",
    "title": "Threat Modeling: The Bare Necessities",
    "abstract": "As a SOC Manager, I am responsible for doing my part in ensuring that our company is secure. One way that I accomplish this is through implementing threat modeling with Splunk Enterprise. Rather than taking a traditional approach of throwing everything and the kitchen sink from the MITRE ATT&CK Framework, we've documented what controls we need to cover down and have created customized alerts to take in the various data contexts to ensure that our alerts are comprehensive and efficient through regular efficiency testing. In this talk, we will review the strategy used for choosing what controls are needed and provide sample SPL used to create our alerts so you can implement them within your own environments.",
    "first_speaker": "Rebecca Blair",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "SEC1885",
    "title": "Tips from the Trenches:  Practical Search and Response to Stop Ransomware with Splunk",
    "abstract": "Ransomware is big business. The more money being made from this digital extortion only makes the problem worse as ransomware gangs become more aggressive and brazen. In this session, we’ll recap the latest ransomware trends, and show you what we can do in Splunk to detect early warning signs. ",
    "first_speaker": "Ryan Gritt",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "SEC1423A",
    "title": "To Data Model or Not to Data Model… Do You Have the Fields? That Is the Question...",
    "abstract": "Data models are highly effective tools when used properly within the context of Splunk Enterprise Security. However, there are many pitfalls if you are not careful. Is your data CIM compliant? Do you know what that means? Does your data have all the fields it needs to be useful within the context of a data model? Do you understand data model acceleration? Join us for a conversation on data models, what they are, as well as best practices for using them. Gain a better understanding and the ability to extend your use of Splunk Enterprise Security and correlation searches using the power of data models.",
    "first_speaker": "Dustin Eastman",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "ITO1612B",
    "title": "Touchless Orchestration of Incident Resolution",
    "abstract": "A high-performance framework that orchestrates automations and resolves \"inevitable outages\" by recognizing \"Technical Intent/problems\" using correlation and machine learning just in time as required nearest to the source device. The Framework could act as highly adoptable, widely applicable insight revealer with a 360 view of workloads.",
    "first_speaker": "Satyan Kumar",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "DEV1453B",
    "title": "Touring the Software Factory: Get Visibility Into Your Pipeline Analytics to Ship Better Software Faster With GitHub",
    "abstract": "Whether you're a Security Ninja, DevOps Guru or an ITOps Rockstar, this tour of the factory has something for you. The first stop on the tour will be source code storage, where you can spot the hive of activity buzzing around different repos, then it's off to the assembly line where we'll see the flow code move through different pipelines and packaging. We'll wrap up our tour at quality control, where you'll see agents investigating malicious commits or knockoff libraries. The software factory is more exciting than you may have thought, and Splunk has teamed up with GitHub to release a new set of add-ons and apps to provide easy visibility into your GitHub based factory!",
    "first_speaker": "Doug Erkkila",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "PLA1503C",
    "title": "Transitioning to a Splunk Cloud Platform Admin: Day One & Beyond",
    "abstract": "You created the vision, delivered the change and now it is time to live it every day, welcome to Splunk Cloud Platform! Now you can make confident decisions and take decisive action on data insights without the need to purchase, manage and deploy additional infrastructure. This panel discussion, intended for Splunk Administrators, Operations Teams and Technology Leaders, will set the foundation for what to expect from day one working in Splunk Cloud Platform. Learn how your team can start to bring data to everything in your organization and build greater impact with your business partners.",
    "first_speaker": "Vladimir Skoryk",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "PLA1690C",
    "title": "TransUnion: Using Anomaly Detection in Dashboard Studio To Reduce MTTR",
    "abstract": "At the start of 2021, the Splunk team at TransUnion adopted the \"Dashboard Beta App\" into our UAT environment. The new 0.9 released at the end of 2020, and the updates bundled up in that release encouraged us to take this app seriously and start developing. Fast forward to today, with the news of the Dashboard Studio in 8.2, we couldn't be more excited to invest more time into building standout dashboards. Let me show you and the Splunk community my integration of Anomaly Detection Forecasting into the Splunk Dashboard Beta. Sit back and enjoy our talk about the captivating dashboards we have built in the Dashboard Beta App.",
    "first_speaker": "Padraic Canavan",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "SEC1701C",
    "title": "Turbocharge Splunk SOAR and SIEM Investments With TruSTAR Intel Workflows",
    "abstract": "One of the key tenets of impactful threat intelligence management is normalizing data from multiple sources to inform process automation better. In this session, you will learn how to set up TruSTAR Intel Workflows to operationalize internal and external intelligence, drive efficiencies in Splunk SOAR tools and improve incident triage. TruSTAR’s no-code approach allows you to set up and manage multiple intelligence workflows tailored to your specific use cases, intel source profiles and destinations of choice. ",
    "first_speaker": "Elvis Hovor",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "TRU1172B",
    "title": "Understanding the Monitoring Console",
    "abstract": "Monitoring Splunk...it's tricky. Well, by utilizing the Monitoring Console, things become a whole lot simpler. We'll dive into what's available in the Monitoring Console and how to use it to alert on and troubleshoot your environment. From data quality to search performance, the Monitoring Console has you covered. As a Splunk Admin, nothing is more important than knowing what's going on inside your environment.",
    "first_speaker": "Clara Merriman",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "ITO1662C",
    "title": "Understanding Why Your Business Tomorrow Needs AIOps Today",
    "abstract": "Digital transformations, cloud journeys, and DevOps adoption have accelerated in all sectors over the past year. IT organizations are often struggling to effectively keep up with the pace of change; driven by accelerating demand for new features, customer experiences and business process improvements. In this talk, we'll highlight the key business considerations for modernizing from your legacy tool chest and implementing an integrated system of tools designed to empower your teams to manage more than they ever thought possible. We'll go even further and discuss how AIOps systems can work in conjunction with key business KPIs to ensure your organization is delivering the best customer experiences and driving more business value.",
    "first_speaker": "Josh Atwell",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "PLA1129C",
    "title": "Using Splunk Product Guidance to Blast You Out of the Beginner Zone",
    "abstract": "Wouldn't it be nice if you had a team of Splunk experts helping you navigate the ins and outs of working with your Splunk platform? They could craft SPL queries, explain how to achieve your use cases with the data sources you have available and show you, step-by-step, dozens of ways to optimize your usage. Well, Splunk Product Guidance (SPG) is the next best thing to having a human to answer all your questions. SPG is an in-product tool that provides relevant, actionable information about working in a Splunk platform. This talk will teach you all about using SPG, as well as how to leverage its broader ecosystem of resources to accelerate your time to value. You'll even discover how you can participate in expanding SPG offerings!",
    "first_speaker": "Jennifer Swallow",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "ITO1223B",
    "title": "Using Splunk to Monitor SAP: The Good, The Bad and the Ugly",
    "abstract": "If your company uses SAP and it's a blind spot for you, you'll want to join us for this session. Splunk Service Intelligence for SAP (SI for SAP), provides out-of-the-box visibility into your SAP systems, identifies problematic hot spots in real time and uses Machine Learning-based predictive analytics to identify brewing misconfigurations as well as faulty functional components. In this session, we'll deep dive into the tips and tricks of leveraging ITSI, PowerConnect and SI for SAP to build and enhance E2E visibility into critical business processes. Learn how real-time SAP KPI monitoring of security user compliance, infrastructure and business data helps prevent SAP outages and lower problem resolution times.",
    "first_speaker": "Brian Bates",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "ITO1617B",
    "title": "Using Splunk To Scale and Drive Cloud Financial Management Processes at Yelp",
    "abstract": "In this talk, come learn about how Yelp has implemented cost showback and forecast processes on the Splunk platform to scale reporting and drive predictive cloud cost analysis. You will get an in-depth look at how Yelp has maintained low budget vs. actuals variance throughout the pandemic with an agile forecasting process. You'll see exactly how to collect cost data from a vendor API via a Splunk custom command and combine it in real time with historical traffic data from Splunk APM to forecast expected changes to cost based on traffic patterns. Additionally, you'll get insights into how to increase accountability of report reviews by leveraging Splunk scheduled reports with a customer-built Jira action.",
    "first_speaker": "Stephen Arthur",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "S4U1736C",
    "title": "Vote Bright Like a Diamond: How Splunk’s Black Employees Resource Group (BEAMs) Created a Movement for Education",
    "abstract": "Vote Bright Like a Diamond (VBLD) is a movement for the Splunk community. It started as a rallying cry to vote in what proved to be the most impactful, pivotal presidential election in US history. But just as importantly, on the heels of a traumatic year -- from the global COVID-19 pandemic to the public death of George Floyd and countless other police-involved murders of people of color -- VBLD raised awareness among Splunkers about the critical political issues that continually impact the Black community, as well as their historical context. Learn how BEAMs members curated content and hosted virtual events to educate Splunkers on direct actions they can take to make government and society more equitable.",
    "first_speaker": "Christopher Russell",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "PLA1468A",
    "title": "What's New in Splunk Cloud Platform",
    "abstract": "Are you excited about all the innovation coming every 4-6 weeks in Splunk Cloud Platform? Join us to learn about the latest and greatest capabilities and explore the vision for what comes next. Build your data strategy with our cloud strategy.",
    "first_speaker": "Sundeep Gupta",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "PLA1143A",
    "title": "What's New in Splunk Enterprise Platform?",
    "abstract": "It's been another exciting year at Splunk, jam-packed with new capabilities added to Splunk Enterprise Platform. Come join the fun and learn about all the cool stuff we’ve delivered. Whether you're a Splunk veteran or a rookie, a small shop or a large organization, and whether you can SPL or not, we have something for you. In this action-packed session we will fly through some of the coolest additions to Splunk Enterprise Platform!",
    "first_speaker": "Isabelle Park",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "SEC1271A",
    "title": "What's New in Splunk Enterprise Security?",
    "abstract": "In this session, learn about all of the latest in Security Analytics innovation coming in the newest release of Splunk Enterprise Security. We will do a deep dive and demos on the new capabilities and fresh interfaces that streamline analyst workflows, extend executive visibility, and build on Risk Based Alerting. Join us as we explore what is in the newest release of Enterprise Security, and hear from ES Product Management leadership about what’s next for ES. ",
    "first_speaker": "Patriz Regalado",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "S4U1535C",
    "title": "Why D&I Is So Much More Than the “New Kid On the Block”",
    "abstract": "The market for capturing and harnessing the next generation of Tech Talent is hot and getting hotter where competition is fierce to capture and foster our thought leaders of tomorrow, so a Diverse and Inclusive mindset has never been more important. Why? Three simple reasons; this demographic is the most diverse in history, 67% of job seekers see D&I as key and organizations with above-average diversity levels outperform other less diverse companies. Join this session to learn how the Splunk ANZ team took this challenge, which many Tech companies face, head on. They will share how they built out a program founded on D&I principles that resonate to deliver huge value to employers and employees.",
    "first_speaker": "Neil Gow",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "ITO1150C",
    "title": "Workforce Analytics To Improve End-User Experience and Performance",
    "abstract": "Aligning and optimizing end-user experience is key to preserving workforce productivity through reduced latency, application uptime, improved security and compliance. There is an increasing number of productivity environments where a combination of local, SaaS, cloud and on-prem resources are being used to conduct work. Splunk Enterprise combined with Splunk Real User Monitoring and SplunkApps can be used as the foundation to address common problems stemming from logon, human error or application and infrastructure issues. By incorporating a workforce analytics strategy focusing on end-user experience, IT desktop and end-user operations can greatly improve user productivity, security and reduce missed opportunities.",
    "first_speaker": "Ray Clearwater",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "PLA1214A",
    "title": "Zero to 100TB/Day in 12 Minutes: Automating Splunk on Azure",
    "abstract": "Want to deploy Splunk on Azure but not sure where to start? This is the session for you! We've created guidance and automation to get a production-ready Splunk platform up and running in your Azure subscription in less than 12 minutes. Your new Splunk platform will be fully configured - following Splunk and Azure's best practices for high availability, performance, security and scalability - and ready to receive up to 100TB/day. We'll provide a walkthrough of how to use the automation to deploy Splunk with VMs or Splunk in AKS. Along the way, we'll give recommendations on choosing your Azure VMs and other tips for the best Splunk performance on Azure. If you're new to Splunk or migrating Splunk to Azure, you don't want to miss this session!",
    "first_speaker": "Darren Wright",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "FEA1834",
    "title": "Driving Customer Success, Together with Partners (AMER)",
    "abstract": "As more and more customers accelerate their cloud migrations and digital transformation, they need our collective help to turn data into doing. And you--our partners--are at the forefront helping them transform as smoothly and effectively as possible. Our top priorities are to support you and add value to your business, as you support our mutual customers. Join Splunk’s VP of Alliances and Channel Ecosystems, Bill Hustad, and Chief Growth Officer & President, Teresa Carlson to hear how we are launching a new modernized Splunk Partner+ Program, built for the cloud. You will learn how we’re creating even more ways for you to grow and deepen your Splunk practices and deliver customer success like never before. ",
    "first_speaker": "Teresa Carlson",
    "start_time_utc": "2021/10/20 17:00:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "ITO1407B",
    "title": "Edge Computing: Transforming Retail & Hospitality IT Operations with Splunk & Reliant",
    "abstract": "Implementing an Edge + Cloud strategy across geographically dispersed retail, hospitality, food service, or convenience store locations can introduce new IT complexities. However, doing so with enterprise-scale and proactive monitoring in mind provides significant advantages for flexibility, performance and security. Join us to learn how Reliant addresses these challenges by bringing together a customizable, hardware-agnostic edge computing platform with Splunk’s infrastructure performance monitoring and troubleshooting. Discover how you can minimize downtime and maximize service performance at the edge by providing high availability and security for your business-critical on-premise workloads.",
    "first_speaker": "Derek Dykens",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "SEC1075A",
    "title": "Effective & Affordable Cyber-Security Vulnerability Management With Splunk Enterprise",
    "abstract": "Vulnerability Management is an automation job. Before you start doing Risk Prioritization, you realize you need to know first what you need to secure. After setting up your scanners and letting them run, you realize you are running on another problem: your integration queries are slow. You cannot even answer how many Windows devices you have without running into inconsistencies and a lot of CSV files. Join this session and learn our approach for high-quality, cybersecurity Vulnerability Management on a large enterprise. We will discuss different techniques to increase the quality of your work with a variety of Splunk's best tech TERM(), PREFIX() & |tstats only queries. No add-ons. No extensions. No extra licenses. Just Splunk Enterprise.",
    "first_speaker": "Daniel Ferreira",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "PLA1080A",
    "title": "Eliminating Cost Multipliers with Splunk on Kubernetes",
    "abstract": "Security analytics, compliance, infrastructure observability in multiple, global public and private infrastructures is challenging and expensive. Splunk running in Kubernetes containers, deployed with Infrastructure as Code (IaC) streamlines, simplifies and helps mitgate the cost multipliers. Our AT&T Chief Security Organization, responsible for threat analytics, compliance and its observability on a terabyte per day scale, uses IaC to deploy Splunk into multiple Kubernetes implementations from a single code base. This solution, built on Splunk, enabled with SmartStore, deploys and scales in minutes without infrastructure specific interfaces and operations, eliminating the need for duplicating the development, operations and maintenance costs dictated by the providers.",
    "first_speaker": "Robert Thorman",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "PLA1314A",
    "title": "Enable Splunk Mobile for Private Networks With Lockheed Martin",
    "abstract": "Having Splunk Mobile available in your pocket is great, but what if you're not able to take advantage of it because of DFARS requirements or security concerns? In this session, you'll learn how deploying a Private Spacebridge might be the right answer! This session will showcase a beta product Splunk has been working on in conjunction with Lockheed Martin, designed to extend Splunk deployments with Splunk Mobile, Splunk TV and Splunk AR applications. They will step you through how this differs from using a Splunk hosted Spacebridge and showcase the strides they've made to make this easy to set up and maintain.",
    "first_speaker": "Roger Triantafilo",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "SEC1108C",
    "title": "Enabling DevSecOps and Securing the Software Factory With Splunk",
    "abstract": "Software delivery chain exploits have been headline news this last year, and tech-enabled enterprises realize the impact that their software delivery chain has on their attack surface and overall business viability. In this session, we'll first discuss how Splunk can be used for DevSecOps use cases, and then we'll look at attack detection use cases for your software development delivery chain using Splunk. We'll focus on TTPs that have been reported from recent incidents and apply anomaly detection, scoring, and aggregation techniques to detect them. After the session, attendees will have access to the data and analytics from the talk via BOSSng, Splunk's new on-demand security workshop platform.",
    "first_speaker": "Dave Herrald",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "ITO1640C",
    "title": "Enriching ITSI Services Using the Content Pack for Splunk Synthetic Monitoring",
    "abstract": "In this session, learn how to integrate Splunk Synthetic Monitoring into your Splunk ITSI instance in a useful way. How do I use data from Splunk Synthetic Monitoring alongside various other types of data that already exist within my Splunk Enterprise instance? You'll learn how that integration works and how to use it in the larger view of Service Intelligence you see in ITSI.",
    "first_speaker": "Joel Schoenberg",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "DVO1334B",
    "title": "Establishing System Reliability With SLIs, SLO and Error Budgets at Raymond James",
    "abstract": "The practice of Site Reliability Engineering is no longer a new idea and SREs can be found in many major companies all over the world. Raymond James Financial has recently started to embrace the practice of Site Reliability Engineering. With the help of Splunk, they have established a successful practice of SLIs, SLOs and error budgets. Their Site Reliability team uses Splunk every day to turn our log data into meaningful observability that our support, development, and architecture teams use to drive our company's innovation and manage our system reliability.",
    "first_speaker": "Graham D'Alessandro",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "DVO1261C",
    "title": "Extending Monitoring With Observability",
    "abstract": "In today's world of cloud-native applications with microservices, ephemeral execution and elastic behavior, we need observability. We already monitor our systems, and observability starts with monitoring. However, observability also goes beyond simple monitoring to give you greater operational insight, leading to shorter incidents, fewer quality problems, a better product and happier customers. So, how do we get from monitoring to observability? What are the differences and extensions we need to consider? How can observability move us to an active response state? In this talk, we will investigate the five characteristics that you need in moving from the known status of your environment to discovering and responding to the unknowns to which we respond. We'll cover what observability is and why it is increasingly important, the telemetry needs of observability and how monitoring extends into this space, and how observability expands your AI/ML to produce better and faster results.",
    "first_speaker": "Stephane Estevez",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "ITO1085C",
    "title": "Fast Pass to Getting Started with Splunk for IT Operations Use Cases",
    "abstract": "Get a deep dive into how best to leverage logs and metrics to monitor key data sources from your on-prem or cloud environments. From system health to system availability, this session will demonstrate the various ways you can get started with monitoring using log data across different platforms such as Linux, Windows, VMWare and cloud (AWS) and how to augment monitoring dashboards with metrics and host metadata. You will come away knowing how to get all the information you need in one place to speed up troubleshooting.",
    "first_speaker": "Thomas Booth",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "FEA1966",
    "title": "Feature Session (AMER) - Breaking Barriers: An Astronaut’s Inspiring & Winding Road to Space",
    "abstract": "Becoming an astronaut wasn’t always a dream for Joan Higginbotham – she wanted to pursue a career in electrical engineering. But when NASA called, she answered. After 9 years working as a NASA rocket scientist, Higginbotham was one of 6,000 people to apply and 122 to be interviewed for the astronaut program. But, ultimately was not chosen. Not a fan of taking “no” for an answer, she didn’t give up and went back to school to receive another graduate degree – becoming accepted as a NASA astronaut candidate in 1996. An inspiring story of the power of seizing opportunities, a strong work ethic, and never giving up, Higginbotham shares how she became the third-ever African American female in space. Taking audiences along her December 2006 mission to the International Space Station (ISS) and using captivating, real-life examples from space, she shares how preparation, teamwork, seeking mentors, and perseverance were key to her success, and demonstrates how these lessons-learned can expand beyond the ISS and be applied to anyone’s circumstances.\n<p> </p>\n<p><strong>Don’t miss this .conf21 moment.</strong> Experience the excitement of this session as it broadcasts live in your timezone. <em>Note: this session will not be available as a true on-demand experience - you will not be able to watch it at your leisure - but you can add the session to your schedule and watch it when it runs in your timezone.</em></p>",
    "first_speaker": "Joan Higginbotham",
    "start_time_utc": "2021/10/20 20:15:00",
    "end_time_utc": "2021/10/20 21:00:00"
  },
  {
    "session_code": "FEA1899",
    "title": "Feature Session (AMER) - Humans of New York: The Power of Authentic Storytelling",
    "abstract": "As the founder of the street portrait blog, Humans of New York, Brandon has emerged as a worldwide Internet phenomenon and one of today’s most influential storytellers. With millions of social media followers, Brandon candidly shares his own story, which like those on HONY, illustrates the power of the Internet, the value of storytelling, and our desire to remain connected with real people in a tech-driven world. His aim is to show the power of one person and one idea to inspire millions, and to encourage others to be a force for good and contribute something meaningful to the world.\n<p> </p>\n<p><strong>Don’t miss this .conf21 moment.</strong> Experience the excitement of this session as it broadcasts live in your timezone. <em>Note: this session will not be available as a true on-demand experience - you will not be able to watch it at your leisure - but you can add the session to your schedule and watch it when it runs in your timezone.</em></p>",
    "first_speaker": "Brandon  Stanton",
    "start_time_utc": "2021/10/19 22:30:00",
    "end_time_utc": "2021/10/19 23:15:00"
  },
  {
    "session_code": "FEA1957",
    "title": "Feature Session (AMER) - Optimizing Human Performance Through Technology",
    "abstract": "In a stunning presentation packed with visuals and interactive exercises, Dr. Poppy Crum explores the human and consumer applications of rapidly-advancing technology. Ticking through the many ways smart technology will improve our lives in years to come, Dr. Crum paints a picture of a future society where companies better understand how customers experience their individual worlds to provide them with products that match their specific needs, where doctors more quickly diagnose and treat patients, where our brains evolve to see at the same resolution as computers, and where the  human capacity for knowledge is expanded exponentially. An optimistic and inspiring overview of a technology-enabled future where human capacity and performance is turbo-charged, as well as the ways organizations can embrace this change now, Dr. Crum argues that technology will not replace human interactions and experiences—but rather make them better than we could ever imagine.<p> </p>\n<p><strong>Don’t miss this .conf21 moment.</strong> Experience the excitement of this session as it broadcasts live in your timezone. <em>Note: this session will not be available as a true on-demand experience - you will not be able to watch it at your leisure - but you can add the session to your schedule and watch it when it runs in your timezone.</em></p>",
    "first_speaker": "Dr. Poppy Crum",
    "start_time_utc": "2021/10/20 18:30:00",
    "end_time_utc": "2021/10/20 19:15:00"
  },
  {
    "session_code": "PLA1559A",
    "title": "FedRAMP and FISMA 101 with Splunk and ATO on AWS Program",
    "abstract": "Creating a FedRAMP/FISMA environment is a complex undertaking. In this session, we will explore how Splunk is used by customers in the Public Sector to manage and create a FedRAMP/FISMA regulated environment. We will discuss the differences between FedRAMP and FISMA and the Pros/Cons of Spunk Cloud Platform and Splunk Enterprise in a compliant workload. Splunk Cloud Platform is FedRAMP Authorized by the General Services Administration FedRAMP PMO at a moderate impact level and is an important tool for log aggregation and log monitoring. Learn how the ATO on AWS program can expedite this journey, with Splunk playing an integral role in meeting various security controls.",
    "first_speaker": "Theodore Steffan",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "SEC1397A",
    "title": "Fighting Fraud: How the New Jersey Office of Information Technology Used Splunk to Detect Fraud and Save Its Citizens Billions of Dollars",
    "abstract": "The U.S. Department of Labor's Office of the Inspector General declared \"…(various) schemes…targeting pandemic unemployment payments represented about $36 billion in losses (nationwide) through November...\" But thanks to the joint efforts of New Jersey's Office of Information Technology and the Department of Labor, using Splunk as our primary investigative tool, our taxpayers were saved over $3.7 billion. Join the NJOIT Splunk Team and learn how to defeat fraudsters using random email addresses, bogus bank accounts, stolen identities and other \"interesting\" behaviors. For example, how about 145 people living in one house filing individual claims?",
    "first_speaker": "Thomas DeHaan",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "SEC1153C",
    "title": "Fighting Ransomware With Splunk Attack Range",
    "abstract": "Ransomware campaigns are in the spotlight of the current threatscape. The Splunk Threat Research Team is constantly addressing new Ransomware campaigns with different variants and payloads that challenge defenders in the enterprise. Join this session to learn from the Splunk Threat Research Team and see real-life examples of ransomware payloads executed against Splunk Attack Range machines. We will highlight how you can use Splunk Attack Range as a tool for analyzing, discovering, detecting, and using playbooks to defend against ransomware. In addition, expert guidance on how to share detections with the community will be provided.",
    "first_speaker": "Rod Soto",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "SEC1194A",
    "title": "Flying High With Splunk SOAR Case Management",
    "abstract": "Splunk SOAR Case Management is a powerful tool to unlock your SOC’s full potential. However, your SOC will not reach that potential without considering the first principles of Case Management design. We will discuss these foundational principles (e.g., case workflow, playbook architecture, and custom dashboarding, etc.), and Uber’s successful journey in applying them. We will also present additional custom features developed by Uber, such as consolidated notes, case relationships and more. With Splunk SOAR, Uber saved over 3000 hours of analyst work in 2020 and tracked 100% of SLA metrics including time to engage, mitigate and resolve.",
    "first_speaker": "Phillip Lee",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "ITO1391B",
    "title": "From API to “Oh My!” – An Automated IT DevOps Self-Healing Journey",
    "abstract": "Large IT Eco-systems have all the resources needed to create a self-healing resilient system; they just don't know it. Image you have every artifact to pinpoint a system failure, but how do you tap into it? Join Lockheed Martin Automation Experts as we dive into Splunk's  custom integrations and automation workflows, capable of self-healing your IT infrastructure and beyond! ",
    "first_speaker": "William Swofford",
    "start_time_utc": "2021/10/19 20:00:00",
    "end_time_utc": "2021/10/19 20:30:00"
  },
  {
    "session_code": "DEV1783C",
    "title": "From \"Create From Template...\" to \"App Installed Successfully\" in Splunk Cloud Platform in Less Than 60 Minutes",
    "abstract": "With all the developer extension points that exist, why build a Splunk app? Why build for Cloud? What are we doing to make it easier to build and test your app for Splunk Cloud Platform? Join us as we take you on to a journey of making your life easier with in-product guidance for getting your app to be cloud ready. Get every dev tool you need running in less than 2 minutes. Get data for testing using Eventgen. Validate your app (AppInspect, etc.). Ultimately, test the installation, configuration flows - Self Service App Installation (SSAI) and functionality of your app in Splunk Cloud Platform. And, publish to Splunkbase.",
    "first_speaker": "Shilpa  Bijam",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "PLA1410C",
    "title": "From Noob to Ninja: Growing and Managing Splunk Enterprise as a Team of One",
    "abstract": "Ask most Splunk admins how many people are needed on the team to keep Splunk Enterprise running smoothly and the answer is usually N+1. However, it doesn’t have to be that way. Learn how to Splunk smarter, not harder, as we trace one Splunker’s journey from noob to ninja. From a few loaner boxes to being designated as a critical application with 400+ Splunk servers serving dozens of internal customers each with their own unique requirements and agendas, and zero headcount growth. See how this lone Splunker leverages ITSI to develop a Splunk health score; builds administrative focused visualizations and views that keeps surprises to a minimum; and identifies automation opportunities so that they can occasionally get some sleep.",
    "first_speaker": "Daniel Burras",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "PLA1451B",
    "title": "From Sensor to Cloud - Build Modern IoT Architectures For Powering Predictive Analytics & Machine Learning in Splunk",
    "abstract": "Past initiatives for digitization in industrial value chains often have resulted in the creation of data silos, lacking an overarching examination layer to provide a holistic view of the data. For end-to-end scenarios in IoT, Splunk can play a key role as a central data compilation layer, providing manifold capabilities for data exploration and advanced analytics. We will discuss how to avoid silos by designing open IoT architectures alongside typical challenges and trade-offs of available protocols and technologies. Further, we will show a state-of-the-art IoT data pipeline combined with Splunk’s unique features for building data-driven applications and ML models to demonstrate its aptitude as the go-to platform for IoT analytics.",
    "first_speaker": "Philipp Redlinger",
    "start_time_utc": "2021/10/20 19:15:00",
    "end_time_utc": "2021/10/20 19:45:00"
  },
  {
    "session_code": "PLA1649A",
    "title": "Gain Insights From Google Cloud Data With Splunk Cloud Platform",
    "abstract": "Do you have workloads on Google Cloud Platorm that you need to keep tabs on? Learn about the latest solutions by Google Cloud Platform and Splunk to help you meet the volume and variety of data you can get from your Google Cloud Platform environments . This session will explore the technologies around this Getting Data In (GDI) topic with best practices from both Google Cloud Platform and Splunk. Leveraging Google Cloud Platform streaming services like Pub/Sub and Dataflow, as well as the Splunk Add-on for GCP. We’ll present sizing guidelines to help optimize for the best performance while considering cost and complexity. We’ll also dive into day 2 operations like monitoring, scaling and error handling for large-scale delivery and wrap up with automation leveraging Terraform.",
    "first_speaker": "Cuyler Dingwell",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "ITO1233B",
    "title": "Gain Real-Time Insights into SAP with Splunk IT Service Intelligence and PowerConnect",
    "abstract": "Do you have SAP systems? Are you looking for a better way to manage the performance of these critical services that run your business? Join this session to learn how to unlock the value of rich technical, security and business data inside SAP with Splunk and PowerConnect from the experts at SoftwareOne. SoftwareOne the developer of PowerConnect software, which is the only SAP Certified SAP to Splunk connector in the market today. You’ll get direct insights into: - Monitoring SAP performance and setting up code profiling - How to correlate SAP telemetry and logs in the application infrastructure - How to identify SAP security risks - A demo of end-to-end business process monitoring for an Order to Cash process inside SAP.",
    "first_speaker": "Warwick Chai",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "PLA1152B",
    "title": "Get the Most Out of Splunk Mobile and Splunk TV",
    "abstract": "Join us to see what’s new in Splunk Mobile and Splunk TV! Whether you are viewing Splunk on the go or displaying your data on the big screen, the Mobile/Tablet/TV experiences are more useful and more powerful than ever. During this session, you will learn how to leverage Splunk Mobile and Splunk TV to get the most out of your data.",
    "first_speaker": "Benjamin Weaver",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "ITO1763C",
    "title": "Getting Started With Logs for Observability, For Splunk Enterprise Customers",
    "abstract": "By now, you've heard about Splunk Observability Cloud and the exciting new DevOps world it unlocks. As a current Splunk customer, this new world may be closer than you think. In this session, we'll show you how Splunk Observability Cloud workflows can be powered by all the wonderful data you're already sending to Splunk. No new instrumentation - just a new way to experience your logs. Find out what you've been missing and what Splunk Observability Cloud can do for you.",
    "first_speaker": "Subu Baskaran",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "DVO1111C",
    "title": "Getting Started With Splunk Observability ",
    "abstract": "Observability has three pillars (Traces, Metrics, Logs), many moving parts and can be overwhelming to get started. We will walk you through the Splunk Observability Application Performance Monitoring (APM) initial steps, starting from downloading a sample application from git all the way to seeing the telemetry reported on the Splunk Observability Cloud platform.",
    "first_speaker": "Kate Hymers",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "DVO1500C",
    "title": "Getting Started With the OpenTelemetry Collector",
    "abstract": "The OpenTelemetry Collector is an open-source and vendor-agnostic way to receive, process and export telemetry data, including metrics, traces and logs. It offers support for open-source projects including Jaeger, Zipkin and Prometheus and is the unified agent for Splunk Observability Cloud. This session will cover the deployment architecture, configuration and production-readiness considerations for the collector. You will see how easy it is to get started and how powerful and extensible the collector is. A demo of collecting and modifying telemetry data will be provided.",
    "first_speaker": "Steve Flanders",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "TRU1192B",
    "title": "Getting To Know Your Data; An SPL Prerequisite",
    "abstract": "How do you go from IDK to SPL? What if there isn't an app for that? Do you need to get started monitoring that custom data set? Implementing Data Models in your environment? Want to make big money as a security use case detection engineer? Then you need to get to know your data.  \nLet me show you how I, for the past 10 years, have been analyzing, normalizing, and working with data for security use cases for some of the biggest companies in the entertainment industry. I'll show you how to learn about your data so you can build your props.conf and search SPL with confidence, knowing that your reports and alerts will return expected results.\n",
    "first_speaker": "Mary Cordova",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "DEV1560B",
    "title": "Go From Zero-to-Automated CI/CD App Building and Testing In 30-Minutes (or Less)",
    "abstract": "Let's re-cap on why using CI/CD to build your Splunk apps is so important and how it will bring you confidence in the apps you deploy. We'll then dive into an interactive demo of building a Splunk app with an automated workflow to build and test, giving you everything you need for a robust platform to build your Splunk apps with confidence and predictable results.",
    "first_speaker": "William Searle",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  },
  {
    "session_code": "SEC1689C",
    "title": "Got Assets? Detecting & Protecting Your Assets With Splunk",
    "abstract": "Understanding your assets (all of them and not just the ones you thought you were protecting) is a critical foundation for any \"risk-based\" security practice. How many times have you heard \"I don't trust our CMDB\" or \"Our Asset data is a mess\"? Our collective experience has taught us that this is one of the hardest things to get right. Join us as we break down the options available and show you some of the key technical steps for developing a successful approach to asset discovery with Splunk. Splunk, as a platform, is ideally suited to become both the detection mechanism and the system of record enabling you to more accurately identify the real assets present in your network.",
    "first_speaker": "James Young",
    "start_time_utc": "2021/10/19 19:30:00",
    "end_time_utc": "2021/10/19 20:00:00"
  },
  {
    "session_code": "S4U1650B",
    "title": "Having the Best 1x of Your Life",
    "abstract": "Everywhere we look, someone is telling us their secrets to success, the key to high-performance, how to be at the top of your field. “You have to WANT to be 10x!” The attitude and insistence are toxic and counterproductive for most professionals, especially in the technology field. In this session, your reasonably successful presenters will discuss how we should work together to make average great again. Ironically, we’ll share our tips for a successful career through reasonable and sustainable means.",
    "first_speaker": "Josh Atwell",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "ITO1254B",
    "title": "Health of Transport's Critical IT, Business Services and Their Infrastructure Health on the Go",
    "abstract": "Transport for NSW (TfNSW) has operational visibility of all key critical services on Mobile for Executives. Transport uses a range of Splunk products together to gain the E2E visibility for a range of services. Some of the key products they use are Splunk ITSI, ES, On-Call, Connected experiences, SAP Power connect, SIM & VMware. See the team's journey and acceleration to Splunk Cloud Platform and Splunk Mobile to support a statewide service on Networks Operations Center, Security Operations Center & Rail Operations Center.",
    "first_speaker": "Ravi Teja Prabhu Jammulamadaka",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "ITO1704B",
    "title": "How a Government Agency Unified Operational Silos and Improved the Lives of Its Citizens Using Insights Provided by Splunk",
    "abstract": "Looking to consolidate tools? Look no further than Splunk. In this session, you'll hear how government agency CalPERS sunset 4 different monitoring tools and adopted one — Splunk. And by getting important logs in one place, not only has IT's job become easier, but citizens' lives and experiences using an app to access their pension have significantly improved. Hear best practices from modeling raw data ingestion to building alerts, dashboards and reports. Then, see for yourself the impressive dashboards that include application url statistics alongside a geographical IP dashboard, providing visualizations and insights into where staff is logging in from across the world. ",
    "first_speaker": "John Coffelt",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "SEC1527B",
    "title": "How BlockFi Is Using Machine Learning To Take Crypto Safety to the Moon!",
    "abstract": "BlockFi is a cryptocurrency platform that allows its clients to grow wealth through various financial products capabilities, including loans, trading and interest accounts. The safety of our client's assets and personal information is taken very seriously by the security operations team. In this session, we will showcase how BlockFI uses Splunk to identify operational risks and ensure the safety of client assets leveraging different machine learning techniques such as anomaly detection, forecasting and graph analytics. We will demonstrate fraud identification, account takeover and data mining using graphs to ensure client safety. Additionally, we will showcase how to improve ML operations using summarization and feature development.",
    "first_speaker": "Anthony Tellez",
    "start_time_utc": "2021/10/19 20:30:00",
    "end_time_utc": "2021/10/19 21:00:00"
  },
  {
    "session_code": "ITO1281B",
    "title": "How Grainger Uses Splunk ITSI to Accelerate Root Cause Analysis and Visualize Service Insights",
    "abstract": "Grainger has always had issues with finding the smoking gun. Grainger is a MRO company that relies heavily on SAP for our ecommerce business, reducing the time to resolve has been a goal for years. Looking at all the symptoms of an outage and not being able to see the big picture or be proactive in finding root cause before it escalates into an outage - is why we brought in Splunk ITSI.",
    "first_speaker": "John Blanchard",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "DEV1328C",
    "title": "How I Built It: Extending the New Dashboard Framework for Real-World Applications",
    "abstract": "Want to unlock advanced dashboarding and visualization capabilities? \n \nYou can extend the core dashboard framework to create custom layouts, visualizations, data sources, event handlers and more. Join us to learn more about how to get started extending the dashboard framework and see how it can come together to build powerful Splunk applications with customer examples!\n",
    "first_speaker": "Atef KOUKI",
    "start_time_utc": "2021/10/20 18:15:00",
    "end_time_utc": "2021/10/20 18:45:00"
  },
  {
    "session_code": "DEV1775B",
    "title": "How NASA Went From App Best Practices To Metaprogramming Better Apps",
    "abstract": "Relive the adrenaline-pumping journey as NASA partners with Splunk to go beyond the app design gravity hold, through to the best practices asteroid belt, and eventually landing on NASA's solution for an on-the-fly conf file and knowledge object management solution. Break out of your black hole of conf stanza management. Discover NASA's concrete examples from apps they've developed to support NASA's Earth Science Data and Information System's operations. Rover over to this talk because, after all, Splunk's not rocket science.",
    "first_speaker": "Burch >",
    "start_time_utc": "2021/10/20 17:45:00",
    "end_time_utc": "2021/10/20 18:15:00"
  },
  {
    "session_code": "DVO1336C",
    "title": "How Observability Enables Distributed Incident Management",
    "abstract": "As applications become increasingly complex, holding the entire architecture of a site in your head becomes more and more difficult. To help mitigate this, Splunk's Observability team has adopted a distributed incident response approach. In this approach, there's no single point of contact (e.g., a NOC) for alerting, response and follow up. Instead, when an incident occurs, Splunk Incident Response routes the incident to a product owner responsible for handling it. They are accountable for their particular part of the stack, reducing alerts going to the wrong person and speeding MTTRs. This session will share how Splunk Observability Cloud lets us monitor, triage and resolve incidents without a centralized response team.",
    "first_speaker": "Ram Jothikumar",
    "start_time_utc": "2021/10/19 23:30:00",
    "end_time_utc": "2021/10/20 00:00:00"
  },
  {
    "session_code": "S4U1579B",
    "title": "How Splunk for Good Built and Implemented a COVID-19 Testing and Screening Solution for a County in Texas",
    "abstract": "In 2020 Tarrant County, Texas, was looking for a way to manage their COVID-19 Screen and Testing efforts. This talk will explain how Splunk for Good played a role in building a COVID-19 Screen and Test platform, completely from scratch, by partnering with companies like Adobe, Oracle, Accenture and others. The project involved everything from real-time data analysis, Cloud Technology and the all-new Splunk Dashboard Studio. We'll dig into how one Splunk environment can simultaneously be used to ensure the security and up-time of an end-to-end solution and display mission-critical data like COVID-19 Screening and Testing status to the world.",
    "first_speaker": "Ryan O'Connor",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "DVO1290A",
    "title": "How Splunk Speeds Up Troubleshooting With Code-Level Visibility",
    "abstract": "Sometimes metrics, traces and logs are not enough to know how to fix a performance issue. You might understand the impact and have an idea of which part of your application is at fault, but it might still take you days to figure out which line in code needs to be changed. This is where continuous, always-on profiling of production code comes to the rescue. Join Priit Potter, Product Manager, as he demonstrates how to troubleshoot faster with code-level visibility into service performance.",
    "first_speaker": "Priit Potter",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "PLA1373A",
    "title": "How T-Mobile Increased Splunk User Proficiency (Across 7,800 Users!) With a World-Class Center of Excellence",
    "abstract": "Is your scale causing performance challenges? Do you spend all day trying to protect users from themselves? T-Mobile supports a large self-service user base of ~7800 users. An environment this large brings with it a number of its own challenges, most notably the \"noisy neighbor\" problem impacting the performance of the service as a whole. T-Mobile tackled the problem by starting its own Center of Excellence to understand how users perceived and interacted with Splunk and their impact on the platform. We will dive into how a maturity level was determined and applied to the user base, identifying problem users, how this frames an educational path, and then feeds an engagement and enablement feedback loop.\n",
    "first_speaker": "John Isenhart",
    "start_time_utc": "2021/10/20 17:15:00",
    "end_time_utc": "2021/10/20 17:45:00"
  },
  {
    "session_code": "DEV1132B",
    "title": "How To Become the Best SPL Reviewer",
    "abstract": "What have you been developing before Splunk? \n \n If you are struggling in collaborative development and code review, unlike the way you have developed before as a Splunk Developer, here is the solution.  \n Learn how to set up an independent Collaborative Development Environment (CDE) in Splunk that includes a way to share indexes (raw data) of remote indexer and create data summaries in the local indexer of each developer. \n \nThis makes it easy for developers to add their own changes to Version Control System (VCS) and review SPL in saved searches which was difficult to review because it's written in .conf file. \n \n Also, you can do more in-depth code reviewing with Compare Search App we developed. \n \n Now, don't be afraid of collaborative development.\n",
    "first_speaker": "Nuri On",
    "start_time_utc": "2021/10/20 20:45:00",
    "end_time_utc": "2021/10/20 21:15:00"
  },
  {
    "session_code": "ITO1165C",
    "title": "How To Build and Scale Services and KPIs Using Service Templates in IT Service Intelligence",
    "abstract": "Do you like manually creating Services and KPIs in ITSI? Then this is NOT the session for you. However, if centralized management, automation and clever processes are more your thing, this is your session! This session is enablement focused, demo-heavy and covers best practices for creating Services and Service Trees automatically, where we walk through, soup to nuts, the process of creating KPIs, a vetting process to ensure they will work at scale and how to apply them to all relevant services via service templates. Participants will leave with practical examples and a documented methodology to use in their own environments.",
    "first_speaker": "Jeff Wiedemann",
    "start_time_utc": "2021/10/20 21:45:00",
    "end_time_utc": "2021/10/20 22:15:00"
  },
  {
    "session_code": "ITO1330B",
    "title": "How To Get Stakeholders Standing in Line for Dashboards: Chipotle’s Digital Journey Using Splunk",
    "abstract": "Imagine if every day using Splunk could be like National Burrito Day. Chipotle’s journey spinning up a new shared services team around Splunk deployment has aided in our digital platform growth of 174.1% year over year and helped stakeholders make critical business decisions beyond just preventing outages. From this presentation, learn 4 key lessons the Splunk engineering team at Chipotle has discovered and how you can get your stakeholders standing in line for your dashboards and insights too.",
    "first_speaker": "Mark Ellis",
    "start_time_utc": "2021/10/20 19:45:00",
    "end_time_utc": "2021/10/20 20:15:00"
  },
  {
    "session_code": "ITO1627B",
    "title": "How to Leverage Splunk for Complete & Accurate Business Process Monitoring",
    "abstract": "Learn how Freddie Mac harnessed data to provide a state-of-the-art monitoring suite that touches the majority of Americans. Are large-scale transformation initiatives hard to monitor and control for your company? Does it take months/years to stabilize after the change and harness the power of newly provided data? Does customer service suffer during the change? Learn how Freddie Mac was able to partner with Splunk during an industry-wide transformation to:\n -Provide clear visibility/insights to oversee operations \n -Automate monitoring of 75+ business-critical processes \n -Address inquiries from our regulator for providing customer impact\n -Proactively identify system/data anomalies in real time \n -Automate 10+ hours of weekly manual reporting\n",
    "first_speaker": "Lucas Young",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "PLA1116B",
    "title": "How to Make Your Splunk Platform More Compliant With jQuery & Python Upgrades",
    "abstract": "Having a trusted and reliable data platform is critical to business success. Splunk is committed to helping our customers maintain healthy and compliant Splunk stacks. This session will educate Splunk Admins, Developers and Users about how to ensure their Splunk Platform can be made more safe and reliable by upgrading to jQuery 3.5 and Python 3. The solutions provided also apply to premium applications such as Splunk Enterprise Security and ITSI, as well as Splunkbase applications. This session will also highlight what developers need to do to prepare for the upgrades.",
    "first_speaker": "Aditya Tammana",
    "start_time_utc": "2021/10/19 21:30:00",
    "end_time_utc": "2021/10/19 22:00:00"
  },
  {
    "session_code": "ITO1544B",
    "title": "How to Surf the Big Wave Of Observability Like a Pro",
    "abstract": "And by Big Wave, we mean ingesting over 200TB of data a day, powering 150,000 searches for over 5000 developers, that’s huge Brah! But big waves mean extra big challenges to tackle head-on. Talking performance, reliability and scalability is real gnarly.\n \nSo, come and hear the lessons learned by Atlassian, the world leader in software collaboration tools, as they took these challenges head-on, where the key to their success was completing a monster 2PB data move to S3; listen to how the team did this as well as overcome their challenges to become the ultimate Surfing Ninjas!\n",
    "first_speaker": "Santosh Bala",
    "start_time_utc": "2021/10/19 23:00:00",
    "end_time_utc": "2021/10/19 23:30:00"
  },
  {
    "session_code": "KEY1829",
    "title": "How to Turn Data Into Doing (AMER)",
    "abstract": "You are the extraordinary people who are tasked with making your organizations more secure, resilient, and innovative.  To achieve these outcomes in this complex, unpredictable environment, you need to effectively harness your data-- yet there are many barriers between data and action. Join Splunk executives and leaders from McLaren, AWS and more to learn how you can turn data into doing and how Splunk is innovating to build your data foundation, so you can solve the challenges of tomorrow.",
    "first_speaker": "Doug Merritt",
    "start_time_utc": "2021/10/19 16:00:00",
    "end_time_utc": "2021/10/19 17:30:00"
  },
  {
    "session_code": "SEC1342A",
    "title": "How to Use Splunk to Protect the PLC That's Running Your Industrial Process",
    "abstract": "Industrial processes are typically controlled by hardened devices called Programmable Logic Controllers (PLC). Technological improvements in networking have unfortunately exposed PLCs to malicious actors and the ransomware wars. This malicious interaction can have dangerous consequences because of its potential impact on human and environmental safety and result in costly downtime. Part of an effective multilayered defense includes monitoring for tampering. Since PLCs do not run on Windows or Linux, no off-the-shelf software products like anti-virus scanners or host firewalls exist that can be installed on them. Currently, the only way to monitor a PLC is by externally watching its network traffic. We will demonstrate an innovative solution consisting of developing a local agent natively in the PLC that generates monitoring data to be ingested into Splunk, where analytics can be developed to detect cyber threats.",
    "first_speaker": "Hien Nguyen",
    "start_time_utc": "2021/10/20 21:15:00",
    "end_time_utc": "2021/10/20 21:45:00"
  },
  {
    "session_code": "SEC1441A",
    "title": "How We Maintain Our Correlations in Splunk Enterprise Security at Thales UK    ",
    "abstract": "How do you ensure that the detections you build today are still valid a year from now? Thales UK has 150+ correlations in Splunk ES all at levels of maturity, depending on how much we knew at the time they wrote them, and they want to add many more (RBA, ftw!). Join to see the workflows that Thales UK uses to effectively manage and increase quality with a dashboard that audits their correlations against their defined best practices. See how they have created a to-do system where analysts and developers add tasks against correlations and optionally link them to problematic notables in IR, and learn how their all-in-Splunk after-the-fact peer review system enables them to track and validate changes to their correlations.",
    "first_speaker": "Gabriel Vasseur",
    "start_time_utc": "2021/10/19 22:00:00",
    "end_time_utc": "2021/10/19 22:30:00"
  }
]
